[[{"episodeNumber":"1","title":"\"The Right Kite\"","location":"The Himalayas","isPartOfDoubleEpisode":false,"description":" Akas wants to participate in a kite-flying festival. He has a kite, but his younger brother, Remi, wants to play with it, too. Unfortunately, two red pandas took the kite and flew into the air with it. Can Jett figure out how the brothers and the red pandas can enjoy the kite all together?\nPackage item : A kite kit for Akas\nWord of this episode : नमस्ते (Namaste; Hello) in Hindi formal custom\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"2","title":"\"Shadow Play\"","location":"Beijing","isPartOfDoubleEpisode":false,"description":" Mei's father owns and operates a popular Chinese dumpling restaurant. However, he is so busy that he may not make it to see his daughter's and her friends' shadow play that very night. How is Jett going to help Mei's father get to the play in time?\nPackage item : A shadow puppet for Mei\nWord of this episode : 你好 (\"Ní hăo\"; Hello) and 再見 (\"Zàijiàn\"; Goodbye) in Mandarin Chinese\n\nSuper Wings helper : Donnie"},{"episodeNumber":"3","title":"\"Great Gondolas\"","location":"Venice","isPartOfDoubleEpisode":false,"description":" Luca is organizing a masquerade ball at his house. Unfortunately, he did nearly forget to deliver the invitations to his friends. On top of that, both Jett and Luca end up stuck in a \"traffic jam\" at a canal. Can Jett help Luca finish the deliveries in time before the party begins?\nPackage item : A masquerade hat for Luca\nWords of this episode : Grazie (Thank you) and Prego (You're welcome) in Italian\n\nSuper Wings helper : Paul"},{"episodeNumber":"4","title":"\"Aloha Adventure\"","location":"/ Hawaii","isPartOfDoubleEpisode":false,"description":" Kelani is participating in a hula dance contest. In order for Kelani to go there, she and her family must pass by an erupting volcano. Can Jett help her get there in time?\nPackage item : A hula skirt for Kelani\nWord of this episode : Aloha (Hello) in Hawaiian\n\nSuper Wings helper : Donnie"},{"episodeNumber":"5","title":"\"Puppies for a Princess\"","location":"/ England","isPartOfDoubleEpisode":false,"description":" Princess Maribelle is hosting a tea party for her royal friends. The reason for this occasion is to present the princess' five puppies a collar of their own. However, the puppies got loose, took the collars, and disappeared into a garden maze. Can she and Jett lead the puppies out of the maze in time for the party?\nPackage item : Five dog collars for Princess Maribelle's five puppies\nWord of this episode : Cheerio (Goodbye) in British English\n\nSuper Wings helper : Jerome"},{"episodeNumber":"6","title":"\"Sahara Sled\"","location":"Morocco","isPartOfDoubleEpisode":false,"description":" Ali wants to play in the snow, despite that there is none in the Sahara. Once he gets his sled, he goes toward a nearby dune to try it out. However, Ali realizes that the sled would only work better with snow. How is Jett supposed to bring snow to a desert?\nPackage item : A snowracer sled for Ali\nPhrase of this episode : As-salamu alaykum (السلام عليكمقچق Peace be upon you) in Arabic\n\nSuper Wings helpers : Dizzy and Donnie"},{"episodeNumber":"7","title":"\"Lights, Camera, Action!\"","location":"/ Hollywood","isPartOfDoubleEpisode":false,"description":" Riley is directing a film called \"Alien Monster from Planet Cool\" and wants Jett to be in it. His other friends for this movie are Victoria and Jerald. During the filming, Riley starts to become emotional and arrogant. When he tells Victoria to scream, she ends up saying that the film has too much violence and wants to leave the set. Could a change of the movie's perspective be possible?\nPackage item : An alien mask for Riley\nWords of this episode : Action (start a movie scene) and Cut (end filming)\n\nSuper Wings helper : Jerome"},{"episodeNumber":"8","title":"\"Bubble Trouble\"[4]","location":"/ Scotland","isPartOfDoubleEpisode":false,"description":" Callum wants to play the bagpipe, in order to bring Nessie out from under the loch's surface. However, he created a soap bubble so large that it sucks the bagpipe into itself. On top of that, Jett could not catch it in time, before it went into the loch. Will Jett and Callum ever get the chance to see Nessie?\nPackage item : A bagpipe with bubbles for Callum\nWord of this episode : Aye (Yes) in Scots language\n\nSuper Wings helper : Mira"},{"episodeNumber":"9","title":"\"Race Against Time\"","location":"Kenya","isPartOfDoubleEpisode":false,"description":" Lorna is participating in a road race against four other competitors. If she wins this race, then she can qualify to run in Africa's big race. Along the way, Lorna had to stop temporarily, due to a herd of so called wildebeest well that is what they call them when they are clearly Antelopes running across the road. Unfortunately, a baby wildebeest got separated from them. Lorna decides that she will stay with the baby, until the herd comes back to get her. Can Lorna come back from behind to win the race?\nPackage item : Sneakers for Lorna\nWord of this episode : Jambo! (Hello!) in Swahili\n\nSuper Wings helper : Bello"},{"episodeNumber":"10","title":"\"Mongolian Stars\"","location":"Mongolia","isPartOfDoubleEpisode":false,"description":" Nambayar lives in a ger with her father. She is very fond of stars. However, Nambayar had accidentally threw the package of stars in the air, causing them to land on her herd of sheep. How are Jett and Nambayar going to get those stars off the sheep?\nPackage item : Glow-in-the-dark stars for Nambayar's ger\nWord of this episode : Сайн байна уу (Sain baina uu; Hello) in Mongolian Cyrillic\n\nSuper Wings helper : Grand Albert"},{"episodeNumber":"11","title":"\"Samba Spectacular\"","location":"Rio de Janeiro","isPartOfDoubleEpisode":false,"description":" Camila is participating in the Rio Carnival with her father. However, she needs to practice her samba dance moves. Once she and her father arrive at the Sambadrome, they have a great time. That is, until a flat tire stopped the entire show from moving on. How is Jett going to solve this problem?\nPackage item : A samba headdress for Camila\nWord of this episode : Bacana (Cool) in Portuguese (Brazil)\n\nSuper Wings helper : Jerome"},{"episodeNumber":"12","title":"\"The Pyramid Kid\"","location":"Egypt","isPartOfDoubleEpisode":false,"description":" Akiiki wants to be an archaeologist, like his grandfather Sallah. He wants to help his grandfather get the one cat figure that has eluded him: a Great Golden Cat. At the excavation site, Jett sets things in motion, by pressing a secret button to a secret and unexplored chamber. Jett gets another surprise, when he pressed the scarab button and it reveals an ancient box. Using the key Akiiki found earlier, he unlocks the box to reveal the Great Golden Cat. Unfortunately, the two of them sets off a big trap, after picking it up from its pedestal. Can the both of them escape alive with the cat figure?\nPackage item : An archaeology kit for Akiiki\nWord of this episode : يالا (Yalla; Let's go) in Arabic\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"13","title":"\"Cold Feet\"","location":"/ Vancouver","isPartOfDoubleEpisode":false,"description":" Drew is part of the red team at an ice hockey game. He and his fellow players are up against the blue team. However, he is mostly nervous, especially when he is being watched by many people in the stands. Can Drew overcome his anthropophobia and help his team win the game?\nPackage item : A pair of ice hockey skates for Drew\nWord of this episode : Eh? (Right?) in Canadian English\n\nSuper Wings helper : Grand Albert"},{"episodeNumber":"14","title":"\"Gorilla Band\"","location":"Democratic Republic of the Congo","isPartOfDoubleEpisode":false,"description":" Lulu and her brother, Jelani, are going to participate in a village festival. However, they need to practice their drumming skills. When they went off to get a snack, a mountain gorilla came down from a tree and starts beating the drums. Unfortunately, the gorilla gets scared and runs off, after seeing Lulu run towards him. How would Jett and his friends get the gorilla to come back and perform with them?\nPackage item : Conga drums for Lulu and Jelani\nWord of this episode : Mbote (Hello) in Lingala\n\nSuper Wings helper : Bello"},{"episodeNumber":"15","title":"\"Balancing Act\"","location":"Moscow","isPartOfDoubleEpisode":false,"description":" Yuri is part of a circus family called the Flipidovskis. The circus is ready to go, but the rest of his family has not arrived yet. They are on a train that got stopped by an avalanche and by a destroyed railway bridge. Meanwhile, the audience is getting impatient and bored. Can Jett save the circus from becoming a big disappointment?\nPackage item : A unicycle for Yuri\nWord of this episode : Ура (\"Ura\"; Hooray) in Russian\n\nSuper Wings helper : Donnie"},{"episodeNumber":"16","title":"\"Paper Rangers\"","location":"Tokyo","isPartOfDoubleEpisode":false,"description":" Yuki is a member of the Paper Rangers, along with his friends Masako and Haru. There was one more member named Namiko, but her family was moving away. The three-member team builds a paper robot called the Jumbo Roboto: a parting gift for Namiko. Once they get to her old house and ring the doorbell, the family has already moved out. How are they going to give Namiko the present?\nPackage item : Origami papers for Yuki, Masako, and Haru\nWords of this episode : こんにちは or 今日は (\"Konichiwa\"; Hello) and さようなら (\"Sayonara\"; Goodbye) in Japanese\n\nSuper Wings helper : Donnie"},{"episodeNumber":"17","title":"\"Viking Voyage\"","location":"Norway","isPartOfDoubleEpisode":false,"description":" Karl is going to viking camp. Unfortunately, he has little self-confidence and is afraid of almost anything. However, his bravery and quick thinking is put to the test twice on his first day at camp. Can Karl face his fears, save Jett, and help his camp mates from danger?\nPackage item : A Viking helmet for Karl\nWord of this episode : Tusen takk (Thank you) in Norwegian\n\nSuper Wings helper : Mira"},{"episodeNumber":"18","title":"\"Arctic Run\"","location":"/ Greenland","isPartOfDoubleEpisode":false,"description":" Anders is participating in a dog sled race. He asks Jett to join his team and Jett agrees. Also, Jett learns mushing words, like \"Hike!\" (get moving). However, after taking a small lead, the dogs gets distracted by an arctic fox. Therefore, Jett and Anders went off course and do not know where they are. On top of that, Jett's heavy jump on the ice created an ice floe, where they cannot escape and are going out to sea. How will the both of them finish the race now?\nPackage item : A compass for Anders\nWord of this episode : Aluu (Hello) in Greenlandic\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"19","title":"\"A Winning Recipe\"","location":"Paris","isPartOfDoubleEpisode":false,"description":" Martine helps her father, a baker, at their family's Paris pastry shop. He created a big and tall layer cake that needs decorating. The cake's destination is a party at the top of the Eiffel Tower. However, during the decorating process, both Martine and Jett had destroyed the cake by mistake. Where will they find a replacement one for the party? On top of that, how are they going to get it decorated and send it to the Eiffel Tower on time?\nPackage item : A cake decoration kit for Martine\nPhrase of this episode : Ooh là là! (Oh, my!) in French\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"20","title":"\"Follow That Ghost\"","location":"Romania","isPartOfDoubleEpisode":false,"description":" Brigita is hosting a costume party at her castle for her friends Adrian and Jenny. Brigita starts telling a spooky story about the very castle they are in. She says that there is a secret room somewhere inside. After hearing some spooky sounds, everyone goes to the library to find out who or what was making them. First, Brigita found a secret passageway by tilting one of the books. Second, after Jett saves Brigita's cat Lucy, he ended up in a secret room that was part of the story. Unfortunately, he is trapped inside and cannot get out. To make matters worse, the walls are too thick for him to send a distress call to base (Jimbo). Can Jett escape from the secret room?\nPackage item : A flashlight for Brigita\nWord of this episode : Poftim (Here you go) in Romanian\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"21","title":"\"Pop Star\"","location":"Vietnam","isPartOfDoubleEpisode":false,"description":" Sen and her older sister, Kim, loves to hear Kellie's music. Unfortunately, the big Kellie concert is sold out and they cannot go there. In a twist of fate, Kellie's van is stuck in the rice field which is in front of Sen's house. Jett tries to help her get unstuck, but to no avail. Can Jett help Kelly get to her own concert on time?\nPackage item : Two Kellie wigs for Sen and Kim\nPhrase of this episode : Đi với tôi (Come with me) in Vietnamese\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"22","title":"\"Feathered Friends\"","location":"Papua New Guinea","isPartOfDoubleEpisode":false,"description":" Sam wants to take instant pictures of some birds-of-paradise for his younger sister, Angie. They see one, but it was too far away for a good picture. Jett tried to catch it, but it was too fast for him. How is Sam going to get the pictures he needs to show Angie?\nPackage item : A camera for Sam\nWord of this episode : Em nau! (That's cool! or That's great!) in Tok Pisin\n\nSuper Wings helper : Grand Albert"},{"episodeNumber":"23","title":"\"Paint Pals\"","location":"Netherlands","isPartOfDoubleEpisode":false,"description":" Willem won an art contest and his prize was to create a big painting on a wall. However, Willem's family just moved into the area. Therefore, he has no friends at that moment. At the wall itself, Jett helps Willem get eleven new friends to assist him. The painting was finished, but the arrival of a rain storm was in the horizon. All their hard work on the painting could end up being washed away. Can Jett find a way to dry the painting before the rain clouds arrive?\nPackage item : Paintbrushes for Willem\nPhrase of this episode : Hallo, Hoe heet je? (Hello, What's your name?) in Dutch\n\nSuper Wings helper : Donnie"},{"episodeNumber":"24","title":"\"Fiesta! Fiesta!\"","location":"Mexico","isPartOfDoubleEpisode":false,"description":" The twin brothers, Thomás and Manuel, are having a birthday fiesta. However, the whole situation ends up being a competition in who has the best party between them. Without anyone looking, the two piñatas got loose from the tree and went over the wall. Jett has no luck finding them from the air. Can the whole birthday fiesta be saved?\nPackage items : Piñatas for Thomás and Manuel\nPhrase of this episode : Feliz Cumpleaños (Happy Birthday) in Spanish (Latin American)\nSuper Wings helper : Paul\n\nNote : Ray debuts in this episode"},{"episodeNumber":"25","title":"\"Boonying's Bath\"","location":"Bangkok","isPartOfDoubleEpisode":false,"description":" Nayan helps around at her father's elephant sanctuary. When Jerome tries to help her at bath time, Boonying (a young elephant) gets scared and runs away. Unfortunately, Boonying stops running at the top of a cliff. A net has been set up by Nayan and her dad at the bottom, in order to catch the elephant. Could Jerome prevent a nervous Boonying from going over the cliff?\nPackage item : An inflatable bathtub for Nayan's elephant, Boonying\nWord of this episode : สวัสดี (\"Sà-wàt-dee\"; Hello) in Thai\nSuper Wings helper : Jett\n\nNote : Jerome takes over Jett's package delivery mission here. Jimbo was reluctant about this idea, but he lets Jerome give it a try. However, once Jerome arrives in Thailand, he did not count on how complex Jett's missions really are. In the end, he realizes that Jett's job is not easy. Also, Jerome understands that all of Jett's missions involves critical thinking and solving problems, depending on where he is located."},{"episodeNumber":"26","title":"\"Family Time\"[5]","location":"Seoul","isPartOfDoubleEpisode":false,"description":" Hye Mi's father is a mail carrier. After he leaves home, Jett arrives and gives the package to Hye Mi. Also, Jett gets permission to go to Hye Mi's primary school and to have dinner with her family. After both Jett and Hye Mi entered the restaurant, Hye Mi's father phoned and said that he would not make it to dinner on time. The reason: he has many letters and packages that needs to be delivered. Jett volunteers to help him finish mailing the items. Does everyone get to the restaurant for dinner on time?\nPackage item : A schedule for Hye Mi\nWord of this episode : 빨리  (\"ppal-li\"; Hurry or Quick) in Korean\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"27","title":"\"Fast Track\"","location":"Monaco","isPartOfDoubleEpisode":false,"description":" Alex and Adriana are a brother and sister racing team. They are participating in a soap box derby, by creating a car shaped like a hot dog. Alex has the honor of driving it. Unfortunately, during the race, he goes off course after ducks get in the way of the race track and ends up in real danger of hitting people and going to a busy roadway. How can Alex get back onto the race track and finish the race?\nPackage item : A set of tires for Alex's Hotdog Car\nWord of this episode : Allons-y (Let's go) in French\n\nSuper Wings helper : Paul"},{"episodeNumber":"28","title":"\"Cheese Chase\"","location":"Switzerland","isPartOfDoubleEpisode":false,"description":" Sven's parents agree to make cheese using Sven's recipe. Upon arrival there, Sven teaches Jett how to make homemade Swiss cheese, but with mixed results. On top of that, after all the cheese wheels were loaded onto a horse-driven wagon, Jett had accidentally spooked the horse. Therefore, some of the cheese wheels went down a hill and rolled away. How is Sven's family going to get the runaway cheese wheels and sell them at a town market?\nPackage item : A personalized cheese stamp for Sven\nWord of this episode : Sali (Hello) in a dialect called Swiss German\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"29","title":"\"Runaway Rex\"","location":"Denmark","isPartOfDoubleEpisode":false,"description":" Noah is an inventor. At his laboratory, he unveils to Jett a dinosaur nicknamed the \"Tyblockasaurus Rex\". Once Noah inserts the battery, the dinosaur comes to life. However, when Jett tries out the dinosaur's remote control, it goes out of control. It smashes out the lab door and goes on a rampage on the unsuspecting populace. How is Jett supposed to stop it from terrorizing everyone in town?\nPackage item : A \"dino-sized\" battery for Noah\nWord of this episode : Hej (Hello) and Farvel (Bye-bye) in Danish\n\nSuper Wings helper : Donnie"},{"episodeNumber":"30","title":"\"Zebra Scouts\"","location":"Zimbabwe","isPartOfDoubleEpisode":false,"description":" Tendai is a member of the Zebra Scouts, along with her brother Munaki and friend Ruva. Their scout leader is named Robert. The three members' objective is to receive a nature explorer's badge for each of them. To do that, they need to retrieve three items: a largest leaf from a baobab tree, a wing feather from a taita falcon, and a ripe horned melon. On the way to get a melon, Tendai tripped on a footbridge and dropped the nature box in the river. Jett tried to get it, but was unsuccessful. How are the Zebra Scouts going to complete their objective now?\nPackage item : A Zebra Scout nature box for Tendai\nPhrase of this episode : Mushe Mushe (Very good) in Shona\n\nSuper Wings helper : Grand Albert"},{"episodeNumber":"31","title":"\"Aussie Animals\"","location":"Australia","isPartOfDoubleEpisode":false,"description":" Ruby stars on her own nature show called \"Ruby Talks to the Animals\". Joshua is Ruby's friend and camera operator for the show. Ruby seems to have a talent for understanding animal behaviours. She interviews an emu, a koala, and a mother kangaroo. When Ruby starts having an interview with the kangaroo, she takes the microphone and hops away. Everyone tried to catch up to her, but she hops really fast and escapes. Can Ruby get her microphone back?\nPackage item : A microphone for Ruby\nWords of this episode : G'day (Hello) and Hooroo (Goodbye) in Australian English\n\nSuper Wings helper : Bello"},{"episodeNumber":"32","title":"\"Penguin Parade\"","location":"New Zealand","isPartOfDoubleEpisode":false,"description":" Ella and her mother are going to Antarctica, in order to drop off three lost emperor penguins by boat. Jett agrees to go along with them. Ella keeps the penguins in check by using a whistle. Ella sees Antarctica in her sights, but a ginormous waterspout is blocking their way. Jett tries to steer the boat away from the waterspout, but the weather phenomenon is too strong for him. How are they going to get to Antarctica and drop safely the penguins there in one piece?\nPackage item : A pair of binoculars for Ella\nPhrase of this episode : Good on ya, mate (Well done, friend) in New Zealand English\nSuper Wings helper : Dizzy\n\nNote : An airplane named Fred arrived at World Airport. The reason for his arrival is that he needs more fuel, in order to continue flying to an unspecified location."},{"episodeNumber":"33","title":"\"The Amazing Moritz\"","location":"Vienna","isPartOfDoubleEpisode":false,"description":" Moritz is a magician. He is having his first magic show at a theatre. Jett agrees to be Moritz's assistant. The show starts well, but it turns for the worst, when Marcel the rabbit starts being mischievous. First, he hops away with the magician's hat from Moritz's head. Second, he appears in a flower vase with the flowers. Most of all, he gets away from Jett backstage and escapes with a runaway piano. Can Jett go back to the theatre in time for Moritz's final magic trick?\nPackage item : A magician's hat for Moritz\nWord of this episode : Wunderbar (Wonderful) in German\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"34","title":"\"Blast Off\"","location":"China","isPartOfDoubleEpisode":false,"description":" Yun and his classmates are going to a space centre for a school tour. As a bonus for the group, they get to see a real space shuttle launch from a mission control center. However, Yun got separated from his classmates because he loved the shuttle simulator so much. In fact, he ends up in the real shuttle and takes off with two unsuspecting astronauts to outer space. How is Jett supposed to bring Yun back to Earth?\nPackage item : A spacesuit for Yun\nWord of this episode : 走 (\"Zǒu\"; Go) in Mandarin Chinese\n\nSuper Wings helper : Donnie"},{"episodeNumber":"35","title":"\"Fireman Dad\"","location":"Germany","isPartOfDoubleEpisode":false,"description":" Stephen's father is a firefighter and the fire chief. He was supposed to go to Stephen's school for Job Day. However, there was a fire in the mountains and must be dealt with immediately. As for Stephen's alternate choice, Jett volunteers his time to go to Job Day and explain what his main job is to the class. After that, Stephen sees a forest fire from the window. Also, he sees a scared baby deer at a campsite. Stephen's father takes action and reaches the deer, but the both of them are trapped by a fallen tree. Can Jett rescue them from the fire?\nPackage items : A firefighter's helmet (hat) for Stephen and some unspecified objects for Stephen's classmates\nPhrase of this episode : Danke (Thank you) in German\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"36","title":"\"Square Search\"","location":"Prague","isPartOfDoubleEpisode":false,"description":" An awkward moment for Jett: Marek's family moved out from that Prague address. Therefore, he cannot deliver Marek's package. As a way to find him, Jett flies to the Old Town Square and search for him there. After he arrives at the square, Jett starts to become depressed because nobody knows Marek there. Would Jett be able to find Marek, so he could deliver his package?\nPackage item : A marionette for Marek\nWords of this episode : Ano (Yes) and Ne (No) in Czech\nSuper Wings helper : Jerome\n\nNote : Maybe Marek will write his new address, so Jett will deliver it to Jimbo."},{"episodeNumber":"37","title":"\"Flying Colors\"","location":"India","isPartOfDoubleEpisode":false,"description":" Meena is a dancer at Ms. Patel's dance palace, along with five of her friends. They are practicing their dance moves for a show at a park that very night. However, when Meena opened her package, all the cloth inside were white. Her original order was for colorful costumes. Jett was about to send the package back to World Airport, but Ms. Patel has a better idea: dye their white cloth into different colors. After they were done coloring them and hanged them on a clothes line, the wind took their costumes into the air. Jett manages to catch all of them. On the way back, Jett did not know that Meena's costume got loose from him. Can Jett find that costume before the dance show begins?\nPackage items : White clothes for Meena\nPhrase of this episode : शुक्रीया (\"Shukriya\"; Thank you) in Hindi\n\nSuper Wings helper : Jerome"},{"episodeNumber":"38","title":"\"Pirate Booty\"","location":"/ British Virgin Islands","isPartOfDoubleEpisode":false,"description":" Cassie is going on a treasure hunt, along with her uncle, Eddie, and her parrot Ginger. Jett gets permission from Cassie to go with them, too. First, they enter a cave. Second, Jett presses a button, in which they all end up sliding down towards another part of the cave. Finally, they encounter a sentient pirate ship named Woodbeard. At one part of the ship's main deck, they found a treasure chest full of gold coins and other booty inside. However, Woodbeard cannot sail away from his \"prison\" and that he was depressed, lonely, and sad. What decisions should Jett, Eddie, and Cassie make here?\nPackage item : A pirate hat for Cassie\nPhrase of this episode : \"Cheese and Bread\" (an expressive phrase of being surprised) in British English\nSuper Wings helper : Dizzy\n\nNote : It is intriguing to see that there could have been sentient beings working alongside humans for hundreds of years. Also, it raises questions about how Woodbeard was made and how he came to life during that time."},{"episodeNumber":"39","title":"\"Flight Fans\"","location":"Peru","isPartOfDoubleEpisode":false,"description":" Pilar, Fernanda and Luis visit Pilar's uncle, Nestor, at a local airport. It can only accommodate small planes. When Jett arrives, he is greeted with a big welcome by Pilar and her two friends. What is more astonishing to Jett is that they want to ride with him to the sky. Unfortunately, Jett is not a passenger plane. Can Jett find a way to satisfy Pilar and her friends big wish in flying towards the sky?\nPackage items : Helmets, goggles and scarves for Pilar, Fernanda and Luis\nWord of this episode : Gracias (Thank you) in Spanish\nSuper Wings helpers : Big Wing and Jimbo\n\nNote : This is the one time Jimbo has actually left World Airport, in order to become a temporary flight attendant."},{"episodeNumber":"40","title":"\"Toy Trackers\"","location":"South Africa","isPartOfDoubleEpisode":false,"description":" Dirk is helping his sister, Lina, and his friend, Mbali, find their toys. Dirk concludes that an animal was responsible in taking them. With Jett's and Mbali's help, Dirk suspects that either an elephant, a giraffe or a lion may have taken the toys. In the end, their search was for nothing. However, after Paul arrives to help them, the real culprit shows up and takes the octopus toy bait. Who is this culprit and how does Jett help get back the stolen toys?\nPackage item : An animal track book for Dirk\nWord of this episode : Howzit (Hello) in South African English\n\nSuper Wings helper : Paul"},{"episodeNumber":"41","title":"\"Lion Dance\"","location":"Taiwan","isPartOfDoubleEpisode":false,"description":" Li-Li and Xiaoming are practicing their lion dance moves at a dance school. However, they have trouble synchronizing their dancing together. Also, they are the school's best dancers. Therefore, they get to do a lion dance at a nearby festival. When practicing their lion dance, Li-Li and Xiaoming had accidentally tore the costume in half. How can Jett help Li-Li and Xiaoming work and dance together before the festival starts?\nPackage item : A lion dance costume for both Li-Li and Xiaoming\nWord of this episode : 謝謝 (\"Xiè xiè\"; Thank you) in Mandarin Chinese\n\nSuper Wings helpers : Donnie and Jerome"},{"episodeNumber":"42","title":"\"Miner Problem\"","location":"Bolivia","isPartOfDoubleEpisode":false,"description":" Angelo lost his dog, Pookie Paws, at a nearby and abandoned mine. His grandfather used to work at that particular mine. Jett agrees to help Angelo and his grandfather, in order to search for the missing dog. They ride on a minecart to one of the passageways. After finding the dog, they started to head for home. However, one of Jett's wings chopped off a boulder and it activated the track switch in front of them. To make things worse, that incorrected track led them to a \"roller coaster ride\" and towards a cliff with no bridge. Jett saves everyone from going over a cliff, but they are lost inside that part of the mine. Can they escape from there and see sunlight again?\nPackage item : A miner's hat for Angelo\nWord of this episode : Hola (Hello) in Spanish (Latin American)\n\nSuper Wings helper : Donnie"},{"episodeNumber":"43","title":"\"Snow Ballin'\"","location":"Finland","isPartOfDoubleEpisode":false,"description":" Stig wants to make the biggest snowman in Finland. Jett gets permission from Stig and his father to join in making one. Stig pretends that Jett's snowball is small, in comparison with his own snowball. However, Jett loses his grip on his big snowball, after lifting it. On top of that, it is headed toward a town and picking up various items along the way. How is Jett going to stop it from becoming a menace to the town's inhabitants?\nPackage item : A big winter hat for Stig's biggest snowman\nPhrase of this episode : Kiitos (Thank you) in Finnish\n\nSuper Wings helper : Donnie"},{"episodeNumber":"44","title":"\"Wheel Good Time\"","location":"Bangladesh","isPartOfDoubleEpisode":false,"description":" Ruma needs to help her mother get fruit from a market. However, she needs Jett's help on how to ride her new bike. Eventually, she can ride it without any assistance. After getting some fruit from a market, Ruma and Jett head back to Ruma's houseboat, but the road ahead was flooded. Added to that, the houseboat was floating away and her mother cannot steer it back. How is Jett supposed to help Ruma go across the water and help Ruma's mother turn the boat around toward its mooring?\nPackage items : A bicycle and helmet for Ruma\nPhrase of this episode : ঠিক আছে (\"Thik ache\"; okay) in Bengali\n\nSuper Wings helper : Donnie"},{"episodeNumber":"45","title":"\"Santorini Choo Choo\"","location":"Santorini","isPartOfDoubleEpisode":false,"description":" Katina wants to be the conductor for a pretend train ride with her friends. On their way to the top of Santorini, Katina and Evi have an argument on who is the conductor for this train ride. Unfortunately, it led to a broken rope. How is Jett going to get everyone to the top on time?\nPackage items : A train conductor's hat and rope for Katina\nWord of this episode : Χάρηκα (\"Hárika\"; Nice to meet you) in Greek\nSuper Wings helpers : Donnie and Roy\n\nNote : Roy gets to leave the World Airport for the first time. Also, he can transform into a \"train\", so he can get a head start towards his goal of being one in the future."},{"episodeNumber":"46","title":"\"Rain Ride\"","location":"/ London","isPartOfDoubleEpisode":false,"description":" Cecily cannot wait for her package to arrive. Once she gets it, she names the teddy bear Spencer. When she hugs it, it says \"I sure do.\" Next, Jett and Cecily play the bear in her bedroom, but she wants to go outside to play in the backyard. Since it was raining, Jett uses his umbrella to keep Spencer dry by tying it to the bear. Unfortunately, a gust of wind took Spencer and flies away. Jett tries to catch it a couple of times, but he failed to get the bear. When he arrives at Trafalgar Square, he cannot find Spencer amongst a group of people and their umbrellas. Is there a way for Jett to find him quickly?\nPackage item : A talking teddy bear for Cecily\nWord of this episode : Ta (Thank you) in British English\nSuper Wings helper : Jerome\n\nNote : It is unknown how Cecily manage to contact Jett by his communicator from her house."},{"episodeNumber":"47","title":"\"Fish Friends\"","location":"Maldives","isPartOfDoubleEpisode":false,"description":" Ayesha's pet fish, Sir Salty, is lonely and depressed. She wants to cheer him up by having a castle for his fish bowl. Unfortunately, that idea did not work. Therefore, Ayesha makes the decision to send her fish to a coral reef and release him for good. On the way, however, a giant octopus grabbed on the submarine with its tentacles. How Jett is supposed to untangle himself and the submarine from the octopus' big grip?\nPackage item : A fish bowl castle for Ayesha's fish, Sir Salty\nPhrase of this episode : ކިހިނެހް؟ (\"Kihineh?\"; How are you?) in Dhivehi\n\nSuper Wings helper : Mira"},{"episodeNumber":"48","title":"\"Jamaican Waves\"","location":"Jamaica","isPartOfDoubleEpisode":false,"description":" Shanna is a member of her family's reggae band. A ship captain, Ryan, wants the family to perform on his ship for a party. Shanna's family accepts the offer. They rode on a local bus to the dock. Unfortunately, everyone forgot to take their instruments off the bus, except for Shanna. They search the area for anything that can be used for playing music. To make matters worse, the ship leaves the dock without them. How is Jett going to send the band to the ship?\nPackage item : A guitar for Shanna\nPhrase of this episode : Irie (Feeling good or Feeling great) in Jamaican Patois\n\nSuper Wings helper : Mira"},{"episodeNumber":"49","title":"\"The Good Knight\"","location":"Toledo","isPartOfDoubleEpisode":false,"description":" Carlos is dressed up as a knight. Also, he named his horse Salvador. With his father's permission, Carlos and Jett go out on an adventure. This time, Carlos wants to save a princess in distress. That \"princess\" is Carlos' friend Isabel. The main problem here is that she is \"trapped on top of a tower\", but he has no way to reach her. How is Carlos going to save her?\nPackage item : A riding horse costume for Carlos\nWord of this episode : Vámonos (Let's go) in Spanish\n\nSuper Wings helper : Paul"},{"episodeNumber":"50","title":"\"Wish Upon a Jett\"","location":"Turkey","isPartOfDoubleEpisode":false,"description":" Ayşe loves to be called a princess by her father. He is a hot air balloon tour guide. Also, Ayşe wants to be granted three wishes from a genie. Jett volunteers to be a genie for her. Her first wish was having ice cream on a cone. Her second wish was to wear a princess outfit. Her final wish was to fly on a magic carpet to her father. Unfortunately, the carpet is regular one. How is Jett going to complete Ayşe's final wish?\nPackage item : A magic lamp for Ayşe\nWord of this episode : Selam (Hello) in Turkish\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"51","title":"\"Farmer Jett\"","location":"Southern France","isPartOfDoubleEpisode":false,"description":" Colette is preparing to go to a fairy tale costume ball at a château. After Jett arrives at her farm, she needs to go to the ball, but she and her mother have not started doing the farm chores yet. Jett volunteers his time to do the chores for them. Once Colette went on her way to the château, Jett tries his best to be \"Farmer Jett\". Unfortunately, Jett does not realize that it takes a lot of hard work to keep a farm clean and organized. Meanwhile, at the ball, Colette meets Émile and they dance together. After that, Colette and her mother leave for home. Once they arrive back at the farm, the area is completely messed up. Can Jett gain Colette's trust and help clean up their farm?\nPackage item : A pair of glass slippers for Colette\nWord of this episode : Enchanté (Nice to meet you) in French\n\nSuper Wings helper : Donnie"},{"episodeNumber":"52","title":"\"Acting Up\"","location":"/ New York City","isPartOfDoubleEpisode":false,"description":" Trevor is part of a dance troupe with his four friends. They are named Carmen, Su Jung, Victor, and Rada. Mrs. Meckle owns a theatre where they practice their dance moves. Their dance show is called \"Feet Beat\". In order to get the word out about their performance, a New York City taxi cab offers his service to help them. As a result, many people are flocking to the theatre. Unfortunately, it cannot handle such a huge crowd. Can Trevor and his friends find a bigger stage to perform their dances without turning anyone away?\nPackage items : Five pairs of dancing shoes for Trevor, Carmen, Su Jung, Victor and Rada\nWord of this episode : Encore\n\nSuper Wings helper : Donnie"}],[{"episodeNumber":"1","title":"\"It Came From Hong Kong\"","location":"Hong Kong","isPartOfDoubleEpisode":false,"description":" Jett and Shun Yip think there's a monster destroying the city. Can they find out if it's a real monster or an actor in disguise?\nPackage item : A kung fu hero costume for Shun Yip\nWord of this episode : 勁 (\"Ging\"; Cool) in Cantonese\nSuper Wings helpers : Paul, Mira and Astra\n\nNote : Sky is in charge of running the airport, because her uncle, Jimbo has gone on vacation.Also, this episode was first aired in Canada on September 2, 2017."},{"episodeNumber":"2","title":"\"Yeti Quest\"","location":"Bhutan","isPartOfDoubleEpisode":false,"description":" Jett and Dema have to find a yeti, but there's a bear cub in danger. How will they save him?\nPackage item : A first aid kit for Dema\nWord of this episode : (\"Kuzu Zangpo\"; Hello) in Dzongkha\nSuper Wings helpers : Dizzy and Chase\n\nNote : This episode was first aired in Canada on September 2, 2017."},{"episodeNumber":"3","title":"\"Swimming Pigs\"","location":"Big Major Cay","isPartOfDoubleEpisode":false,"description":" There's a storm coming and the pigs have to get back to shore. How will Jett and his friends save the day?\nPackage items : A snorkeling mask for Jermaine and a floatie for a piglet\nWord of this episode : Tru Tru (Okay) in Bahamian Creole\nSuper Wings helpers : Dizzy, Donnie and Mira\n\nNote : This episode was first aired in Canada on September 3, 2017."},{"episodeNumber":"4","title":"\"The Great Inflate\"","location":"Athens","isPartOfDoubleEpisode":false,"description":" Nikos uses a muscle suit to fight against hydra, but the muscle suit goes outta control. How will the super wings stop it?\nPackage item : A muscle suit for Nikos\nWord of this episode : Καλώς Ορίσατε (\"Kalos Orisate\"; Welcome) in Greek\nSuper Wings helpers : Donnie and Jerome\n\nNote : This episode was first aired in Canada on September 3, 2017."},{"episodeNumber":"5","title":"\"Team Tango\"","location":"Buenos Aires","isPartOfDoubleEpisode":false,"description":" Julieta's mother orders dancing skirts for her daughter, so Julieta can have dancing lessons, but she needs to play soccer. What will Julieta do?\nPackage item : Dancing skirts for Julieta\nWord of this episode : Vamos A Bailar (Let's Dance) in Spanish\nSuper Wings helpers : Jerome and Paul\n\nNote : This episode was first aired in Canada on September 9, 2017."},{"episodeNumber":"6","title":"\"Tip Of The Iceberg\"","location":"/ Alaska","isPartOfDoubleEpisode":false,"description":" Yaari drives Tippy across the sea, but Tippy gets stuck between two icebergs. How will Jett and his super wing friends save the day?\nPackage items : A sea captain's hat and a telescope for Yaari\nWord of this episode : Chiku (Iceberg) in Yup'ik\nSuper Wings helpers : Dizzy and Bello\n\nNote : This episode was first aired in Canada on September 9, 2017."},{"episodeNumber":"7","title":"\"Alp Help\"","location":"Switzerland","isPartOfDoubleEpisode":false,"description":" Lena and Biggie ride on the Heinz, but Heinz goes to wrong way, and becomes derailed. Can Jett and friends get Heinz back on the train track?\nPackage item : A St. Bernard keg for Lena's dog, Biggie\nWord of this episode : Bis Spöter (See You Later) in Swiss German\nSuper Wings helpers : Dizzy and Todd\nNote : This episode was first aired in Canada on September 10, 2017. \n\nNote 2 : When Jett orders canine help, several dogs in various parts of the world appear. One such place that appears is Beijing and you can quickly see three of the children who appeared in the Season One episode Shadow Play."},{"episodeNumber":"8","title":"\"Think Big\"","location":"Peru","isPartOfDoubleEpisode":false,"description":" Mayta and Jett are ready to draw something big in the ground, but it takes forever. What will Jett and Mayta do?\nPackage items : A remote control camera copter for Mayta\nWord of this episode : Sulpayki (Thank you) in Quechuan\nSuper Wings helpers : Dizzy, Donnie, Jerome, Todd and Poppa Wheels\n\nNote : This episode was first aired in Canada on September 10, 2017."},{"episodeNumber":"9","title":"\"Dubai Fly By\"","location":"Dubai","isPartOfDoubleEpisode":false,"description":" Saeed and Jett visit Saeed's mother, who's a construction worker, but Hamad knocks off a piece of a building. Can Jett and his friends stop the accident?\nPackage item : A tool kit for Saeed\nWord of this episode : شكر (\"Shukran\"; Thank you) in Arabic\n\nSuper Wings helpers : Dizzy, Donnie and Todd"},{"episodeNumber":"10","title":"\"The Jeju Giant\"","location":"Jeju Island","isPartOfDoubleEpisode":false,"description":" Tae-Hun's project is finished for the science festival, but Seo-Yoon's robot goes out of control. What will Jett, Tae-Hun, and Seo-Yoon do?\nPackage item : Last Pieces for Tae-Hun's Project\nWord of this episode : (\"Umbrang Hoda\"; Awesome) in Jeju\n\nSuper Wings helpers : Donnie and Astra"},{"episodeNumber":"11","title":"\"Panda-Monium\"","location":"Chengdu","isPartOfDoubleEpisode":false,"description":" Wen and his father in panda costumes and Jett find out that Min disappeared. Can they bring her back?\nPackage item : A panda costume for Wen\nWords of this episode : 好 (\"Hǎo\"; Good) and 很好 (\"Hěn hǎo\"; Very Good) in Mandarin Chinese\n\nSuper Wings helpers : Paul and Grand Albert"},{"episodeNumber":"12","title":"\"The Large Little Laddie\"","location":"Dublin","isPartOfDoubleEpisode":false,"description":" Cian wants to be a giant, but Aidan knocks over Grand Albert's invention, that makes Aidan become a giant. What will Jett, Donnie, Grand Albert, and Cian do?\nPackage item : A pair of stilts for Cian\nWord of this episode : Slán (Goodbye) in Irish\n\nSuper Wings helpers : Donnie, Grand Albert and Poppa Wheels"},{"episodeNumber":"13","title":"\"Tricky Trolls\"","location":"Bergen","isPartOfDoubleEpisode":false,"description":" Hilda's picnic basket gets taken by someone, and Jett and Hilda wonder if they are trolls. How will they get the picnic basket back?\nPackage item : A picnic basket for Hilda\nWord of this episode : Kjempegoat (Delicious) in Norwegian\n\nSuper Wings helpers : Bello, Grand Albert and Todd"},{"episodeNumber":"14","title":"\"Magno Dino\"","location":"/ Drumheller","isPartOfDoubleEpisode":false,"description":" A dinosaur skeleton is finished to be put in a museum, but a dinosaur skeleton goes after the tow truck with a magnet. What will Jett, Donnie, Paul, and Justin do?\nPackage item : An excavation kit for Justin\nWord of this episode : Kerfuffle (Problem)\n\nSuper Wings helpers : Donnie and Paul"},{"episodeNumber":"15","title":"\"Trip to Times Past\"","location":"Dordogne","isPartOfDoubleEpisode":true,"description":" Jett, Grand Albert, and Margot go back in time to see a real mammoth, but a mother mammoth thinks they are bad guys, until a mother mammoth gets stuck in the hole in the ice. What will Jett, Grand Albert, Margot, and Erk do?\nPackage items : A cave painting kit for Margot, Then for Erk\nWord of this episode : Bon Voyage (Have a good trip) in French\nSuper Wings helpers : Dizzy, Donnie and Grand Albert\n\nNote : 2 part episode; Margot gives away a cave painting kit to Erk, maybe she will order another one"},{"episodeNumber":"16","title":"\"Trip to Times Past\"","location":"Dordogne","isPartOfDoubleEpisode":true,"description":" Jett, Grand Albert, and Margot go back in time to see a real mammoth, but a mother mammoth thinks they are bad guys, until a mother mammoth gets stuck in the hole in the ice. What will Jett, Grand Albert, Margot, and Erk do?\nPackage items : A cave painting kit for Margot, Then for Erk\nWord of this episode : Bon Voyage (Have a good trip) in French\nSuper Wings helpers : Dizzy, Donnie and Grand Albert\n\nNote : 2 part episode; Margot gives away a cave painting kit to Erk, maybe she will order another one"},{"episodeNumber":"17","title":"\"House of Ghoulies\"","location":"/ Sleepy Hollow","isPartOfDoubleEpisode":false,"description":" It is Halloween in New York. Irving and Jett check out the haunted mansion, but they are scary creatures inside. What will Jett and Irving do?\nPackage item : A skeleton costume for Irving\nPhrase of this episode : Trick or Treat\n\nSuper Wings helpers : Jerome and Bello"},{"episodeNumber":"18","title":"\"Junior Detectives\"","location":"/ London","isPartOfDoubleEpisode":false,"description":" Archie and Jett have to find a toy alligator. How will Jett and Archie get it back?\nPackage item : A detective kit for Archie\nWord of this episode : Blimey (Oh, my!) in British English\n\nSuper Wings helpers :  Chase and Mira"},{"episodeNumber":"19","title":"\"Home Run Julio\"","location":"Havana","isPartOfDoubleEpisode":false,"description":" Julio has a baseball lesson, but a meteor is heading toward the baseball stadium. What will Jett and Julio do?\nPackage item : A baseball bat for Julio\nWord of this episode : Jonrón (Home Run) in Cuban Spanish\n\nSuper Wings helper : Grand Albert"},{"episodeNumber":"20","title":"\"Waffle Mix-Up\"","location":"Belgium","isPartOfDoubleEpisode":false,"description":" Jules and his grandmother are making a giant waffle, but Jett accidentally adds too much yeast. Can Donnie stop the disaster?\nPackage item : A giant waffle iron for Jules and his grandmother\nWord of this episode : Grotte (Big) in Belgian French\n\nSuper Wings helpers : Donnie, Todd and Poppa Wheels"},{"episodeNumber":"21","title":"\"The Super Seven\"","location":"/ Wyoming","isPartOfDoubleEpisode":false,"description":" Susanna lets her friends take a train, but a steam engine gets too much sun power. How will Jett, Dizzy, and Donnie save the day?\nPackage item : A golden lasso for Susanna\nWord of this episode : Giddy Up\n\nSuper Wings helpers : Dizzy and Donnie"},{"episodeNumber":"22","title":"\"Whale Tale\"","location":"Fiji","isPartOfDoubleEpisode":false,"description":" Jett is on his way to Fiji to deliver a package to a girl named Tima cause it has what she and her friends need to dance in the Hibiscus Festival. But, suddenly, out of nowhere, a big whale emerged from the sea and swallowed up Jett! Would Jett find a way to get outta the whale and make his delivery?\nPackage items : Three whales on sticks for Tima and her two friends\nWord of this episode : Bula (Hello) in Fijian\n\nSuper Wings helpers : Mira and Chase"},{"episodeNumber":"23","title":"\"The Bermuda Blunder\"","location":"/ Hamilton","isPartOfDoubleEpisode":true,"description":" Jett is on his way to deliver a package to a boy named Aaron when he is suddenly caught in a terrible storm. He loses his package and is struck by lightning knocking him into the ocean and disabling his communications with World Airport. Can Jett be rescued from the Bermuda Triangle?\n1st Package item : A birthday cake for Aaron\n2nd Packege item : A bucket and spade for Chelsea\nWords of this episode : Crisp (Stylish) and Taunk Ja (Thank you) in Bermudian English\nSuper Wings helpers : Dizzy, Mira and Chase\nNote 1 : 2-part episode; Flip debuts in this episode.\nNote 2 : In part 1, Chelsea gave Jett the phrase here in Bermudian English only just like Sky did.\n\nNote 3 : 2-part episode; Chelsea also debuts in this episode."},{"episodeNumber":"24","title":"\"The Bermuda Blunder\"","location":"/ Hamilton","isPartOfDoubleEpisode":true,"description":" Jett is on his way to deliver a package to a boy named Aaron when he is suddenly caught in a terrible storm. He loses his package and is struck by lightning knocking him into the ocean and disabling his communications with World Airport. Can Jett be rescued from the Bermuda Triangle?\n1st Package item : A birthday cake for Aaron\n2nd Packege item : A bucket and spade for Chelsea\nWords of this episode : Crisp (Stylish) and Taunk Ja (Thank you) in Bermudian English\nSuper Wings helpers : Dizzy, Mira and Chase\nNote 1 : 2-part episode; Flip debuts in this episode.\nNote 2 : In part 1, Chelsea gave Jett the phrase here in Bermudian English only just like Sky did.\n\nNote 3 : 2-part episode; Chelsea also debuts in this episode."},{"episodeNumber":"25","title":"\"Laugh, Prince, Laugh\"","location":"Vaduz","isPartOfDoubleEpisode":false,"description":" A girl named Alessia ordered a laughing kit to participate in the laughing contest in order to make a serious prince named prince Simon laugh. When she arrives to the castle, she was nervous about performing against the other participants. Can Jett be part of Alessia's comedic act?\nPackage item : A laugh kit for Alessia\nWords of this episode : Ja (Yes) and Nein (No) in German\n\nSuper Wings helpers : Jerome and Grand Albert"},{"episodeNumber":"26","title":"\"Piano Panic\"","location":"Salzburg","isPartOfDoubleEpisode":false,"description":" Oswald has a big piano concert today, but the large piano is too big for him to play by himself. What will Jett and Oswald do?\nPackage item : A tuxedo for Oswald\nWord of this episode : Schön (Beautiful) in German\n\nSuper Wings helpers : Dizzy, Donnie and Jerome"},{"episodeNumber":"27","title":"\"Mission On Mars\"","location":"Chile & Mars","isPartOfDoubleEpisode":false,"description":" Catalina orders a package for her pen pal, Vo, who lives on Mars, but there's no pen pal on Mars. What will Jett, Donnie, Astra, and Catalina do?\nPackage item : A stuffed chilla in a spacesuit for Vo\nPhrase of this episode : Mucho Gusto (Nice to meet you) in Spanish\n\nSuper Wings helpers :  Astra and Donnie"},{"episodeNumber":"28","title":"\"Christmas Down Under\"","location":"Sydney","isPartOfDoubleEpisode":false,"description":" It's Christmas in Australia, Jett and Nicole decorate for Christmas, but Santa Claus and his reindeer get tired. Will Jett and Nicole deliver more presents?\nPackage items : Three Christmas stockings for Nicole and her parents\nWords of this episode : Boomer (Kangaroo) and Chrissie (Christmas) in Australian English\n\nSuper Wings helpers : Donnie, Bello, and Astra"},{"episodeNumber":"29","title":"\"Drills And Thrills\"","location":"Singapore &  Ecuador","isPartOfDoubleEpisode":false,"description":" Rina wants to visit Raul, but Raul on the other side of the earth. What will Jett and Rina do?\nPackage item : A heavy-duty shovel for Rina\nWords of this episode : Swee Swee (Pretty) in Hokkien and Muy Bonito (Very Pretty) in Spanish \nSuper Wings helper : Todd\n\nNote : Raul give Rina the phrase in Spanish just like Sky gave Jett the phrase."},{"episodeNumber":"30","title":"\"The Dragon Flies\"","location":"Kraków","isPartOfDoubleEpisode":false,"description":" Jett, Emilia, and Adaś get ready for a dragon festival, but a fly distracts them. How will Jett and Emilia stop the disaster?\nPackage items : A knight costume for Emilia and a pair of dragon wings for her lizard, Adaś\nWord of this episode : Cześć (Hello) in Polish\n\nSuper Wings helpers : Astra and Chase"},{"episodeNumber":"31","title":"\"Sniff Test\"","location":"Kuching","isPartOfDoubleEpisode":false,"description":" Noriah is have a collection of smells. How will Jett, Noriah and her parents find the big, smelly flower?\nPackage item : A scent brush for Noriah\nWords of this episode : Besar (Big) and Kecil (Small) in Malay\n\nSuper Wings helpers : Dizzy and Todd"},{"episodeNumber":"32","title":"\"The Pumpkin Roll\"","location":"Ludwigsburg","isPartOfDoubleEpisode":false,"description":" Jett, Max, and his grandfather have to take a giant pumpkin to the pumpkin festival, but a pumpkin rolls away. How will Jett and Max stop the huge pumpkin?\nPackage items : Three plastic face parts for Max's pumpkin\nWord of this episode : Kürbis (Pumpkin) in German\n\nSuper Wings helpers : Dizzy, Paul and Chase"},{"episodeNumber":"33","title":"\"Doubles Trouble\"","location":"Indonesia","isPartOfDoubleEpisode":false,"description":" There's a badminton tournament, but Dimas and Dian have got into a big fight. How will Jett and Dimas and Dian's mother find a way to let Dimas and Dian play together?\nPackage items : Two badminton uniforms for Dimas and Dian\nPhrase of this episode : Terima Kasih (Thank you) in Indonesian\nSuper Wings helpers : Flip and Astra \n\nNote : Ray has reappeared."},{"episodeNumber":"34","title":"\"Snow on the Go\"","location":"Namibia","isPartOfDoubleEpisode":false,"description":" Ndapana has a package from her friend, Stig from Finland, but she knows it never snows in Namibia, until Donnie builds a giant snow globe, and Astra adds snow inside, but the giant snow globe rolls over. What will Jett, Donnie, Astra, and Ndapana do?\nPackage item : A snow globe for Ndapana\nWord of this episode : Hello in Namibian English\nSuper Wings helpers : Donnie, Bello and Astra\n\nNote : Stig has reappeared."},{"episodeNumber":"35","title":"\"Mermaid Melody\"","location":"Copenhagen","isPartOfDoubleEpisode":false,"description":" Jett, Mira, and Sofia go underwater to find a mermaid, but they saw an oil ship leaking. How will Jett and Mira save the day?\nPackage item : A waterproof recorder for Sofia\nPhrases of this episode : Tak (Thank you) and Selv Tak (You're welcome) in Danish\n\nSuper Wings helper : Mira"},{"episodeNumber":"36","title":"\"Dalmatian Doggercise\"","location":"Dubrovnik","isPartOfDoubleEpisode":false,"description":" Ivan lets Loona doggercise, but Loona gets away, after Jerome accidentally throws a ball too far away. How will Jett, Jerome, and Ivan get Loona back?\nPackage items : Two exercise outfits for Ivan and his dog, Loona\nWord of this episode : Bok (Hello) in Croatian\n\nSuper Wings helpers : Dizzy and Jerome"},{"episodeNumber":"37","title":"\"Barcelona Birdhouse\"","location":"Barcelona","isPartOfDoubleEpisode":false,"description":" Martha builds a birdhouse for a bird to live in, but the birdhouse is too small for other birds, so she and Jett have to build a giant birdhouse, but it takes too long. What will Martha and Jett do?\nPackage items : Recycled materials for Martha's birdhouse\nWords of this episode : Sisplau (Please) and Gràcies (Thank you) in Catalan\n\nSuper Wings helpers : Donnie, Jerome, Bello and Poppa Wheels"},{"episodeNumber":"38","title":"\"Cat in the Box\"","location":"Tokyo","isPartOfDoubleEpisode":false,"description":" Satomi's cat Tora gets taken to the recycling center by mistake. How will Jett, Satomi and her mother get Tora back?\nPackage item : A cat toy for Satomi's cat, Tora\nWords of this episode : どこ (Doko?; Where?) and あそこ (Asoko; Over There) in Japanese\n\nSuper Wings helpers : Donnie and Paul"},{"episodeNumber":"39","title":"\"Weather or Not\"","location":"Tonga","isPartOfDoubleEpisode":false,"description":" Ofa and her Super Wings friends make their own weather forecast, until a tornado arrives, and Ofa tries to warn everyone, but no one believes her. What will Jett, Donnie, Jerome, Poppa Wheels, and Ofa do?\nPackage item : A microphone for Ofa\nWord of this episode : Alotamaki (Bad Weather) in Tongan\n\nSuper Wings helpers : Donnie, Jerome and Poppa Wheels"},{"episodeNumber":"40","title":"\"Very Special Delivery\"","location":"Jeonju, South Korea &  Antarctica","isPartOfDoubleEpisode":true,"description":" Rana's parents are separated, because Rana's mother lives in Antarctica, and Rana's father lives in South Korea, so Jett has to deliver a songpyeon to Rana's mother, but a snowstorm causes him to get stuck. What will Jett do? How will he make special delivery for Rana's mother?\nPackage items : Ingredients for Rana and her father and a songpyeon for Rana's mother\nWord of this episode : 오늘 (Oneul; Today) in Korean\nSuper Wings helpers : Paul, Chase and Neo\n\nNote : 2-part episode; Neo debuts in this episode"},{"episodeNumber":"41","title":"\"Very Special Delivery\"","location":"Jeonju, South Korea &  Antarctica","isPartOfDoubleEpisode":true,"description":" Rana's parents are separated, because Rana's mother lives in Antarctica, and Rana's father lives in South Korea, so Jett has to deliver a songpyeon to Rana's mother, but a snowstorm causes him to get stuck. What will Jett do? How will he make special delivery for Rana's mother?\nPackage items : Ingredients for Rana and her father and a songpyeon for Rana's mother\nWord of this episode : 오늘 (Oneul; Today) in Korean\nSuper Wings helpers : Paul, Chase and Neo\n\nNote : 2-part episode; Neo debuts in this episode"},{"episodeNumber":"42","title":"\"Ballet Day\"","location":"Siberia","isPartOfDoubleEpisode":false,"description":" Nadia and her Super Wings friends are able to dance ballet, but Nadia's father needs help getting back home. Can Nadia and her Super Wings friends save the day?\nPackage item : A jeweled egg music box for Nadia\nWords of this episode : Спасибо (\"Spasibo\"; Thank you) and Пожалуйста (\"Pozhaluysta\"; You're welcome) in Russian\n\nSuper Wings helpers : Dizzy, Jerome and Flip"},{"episodeNumber":"43","title":"\"The Sheep Heap\"","location":"New Zealand","isPartOfDoubleEpisode":false,"description":" Peter works as a substitute shepherd, and Jett makes the sheep go over the cliff. How will Jett, Peter, and Hine get them back?\nPackage item : A shepherd's staff for Peter\nWord of this episode : Kia Ora (Hi) in Māori\n\nSuper Wings helpers : Jerome and Flip"},{"episodeNumber":"44","title":"\"Blockosaurus Park\"","location":"Romania","isPartOfDoubleEpisode":false,"description":" Yulia's grandfather makes the mechanical robot dinosaurs come to live, but all except Rex go hay-wired, because of the rain. How will Jett, Noah, and Yulia save the day?\nPackage item : A mechanical key for Yulia's grandfather\nWord of this episode : Uimitor (Amazing) in Romanian\nSuper Wings helpers : Donnie, Jerome, Flip and Poppa Wheels\n\nNote : Noah and Rex have reappeared."},{"episodeNumber":"45","title":"\"The Trouble With Trompos\"","location":"Colombia","isPartOfDoubleEpisode":false,"description":" Gabriel and his older sister, Rosana and Jett are going to meet their friends, but, after building a new bridge, and getting Gabriel's trompo back from a monkey, it's getting late. How will Gabriel, Rosana, and their Super Wings friends make it on time?\nPackage item : A trompo for Gabriel\nWord of this episode : Amigos (Friends) in Spanish\n\nSuper Wings helpers : Dizzy and Donnie"},{"episodeNumber":"46","title":"\"Mangrove Mess\"","location":"Cambodia","isPartOfDoubleEpisode":false,"description":" Nita and her father and Jett have to get all the waterproof toys outta the river, but there are too many of them, What will Jett, Nita, and her father do?\nPackage items : Two scoop nets for Nita and her father\nWords of this episode : ទៅ (Tow; Go) and បញ្ឈប់ (Banhchhob; Stop) in Khmer\n\nSuper Wings helpers : Mira, Todd and Grand Albert"},{"episodeNumber":"47","title":"\"There's No Place Like Rome\"","location":"Rome","isPartOfDoubleEpisode":false,"description":" Giuseppe wants a new bike, but a package is for his two younger sisters, who are twins. After that, Giuseppe makes Jett go too fast on the carriage. What will Jett and Giuseppe do?\nPackage item : A chariot stroller for Maria and Francesca\nWord of this episode : Veloce (Fast) in Italian\n\nSuper Wings helpers : Jerome and Chase"},{"episodeNumber":"48","title":"\"Speed Hump\"","location":"Doha","isPartOfDoubleEpisode":false,"description":" Maryam and her pet camel, Ziz are getting ready for the camel fashion show, but Ziz trips into a wheelbarrow, and runs off. How will Jett and Maryam save the day?\nPackage item : A new hat for Maryam's camel, Ziz\nWord of this episode : جيد (Jayyed; Awesome) in Arabic\n\nSuper Wings helpers : Dizzy and Flip"},{"episodeNumber":"49","title":"\"The Spy Who Surprised Me\"","location":"Cape Town","isPartOfDoubleEpisode":false,"description":" It's Unathi's birthday, and Jett and Chase hope they will let Unathi's classmates be invited to the party, but the invitations to Unathi's birthday party get blown into the sea. What will Jett and Chase do?\nPackage item : A spy watch for Unathi\nWord of this episode : Molo (Hello) in Xhosa\n\nSuper Wings helpers : Donnie, Roy and Chase"},{"episodeNumber":"50","title":"\"Great Wall of Go\"","location":"China","isPartOfDoubleEpisode":false,"description":" Yi enters the race called the great wall of go, but the battery goes dead. What will Yi and his pit crew do?\nPackage item : A battery for Yi's go-cart, Clean Green Machine\nWord of this episode : 真棒 (Zhēn bàng; Awesome) in Mandarin Chinese\nSuper Wings helpers : Donnie, Poppa Wheels and Flip\n\nNote : Sammy has reappeared."},{"episodeNumber":"51","title":"\"Trojan Course\"","location":"Istanbul","isPartOfDoubleEpisode":false,"description":" Mehmet has a race of Children's Day, until there are four kids left, but the big rolling horse is driven outta the race by accident. How will Jett save the day?\nPackage item : Nothing for Mehmet\nWords of this episode : Acele et (Hurry Up) and Hoşça kal (Goodbye) in Turkish\nSuper Wings helpers : Dizzy, Donnie, Paul, Big Wing and Poppa Wheels\n\nNote : Some children from the previous episodes have reappeared."},{"episodeNumber":"52","title":"\"Loch Ness on Ice\"","location":"/ Scotland","isPartOfDoubleEpisode":false,"description":" Callum and his super wing friends are playing curling, but the curling stone with Nessie's children go too far. How will Callum, Nessie, and their Super Wings friends get them back?\nPackage item : A curling stone for Callum\nWord of this episode : Wee (Little) in Scots language\nSuper Wings helpers : Astra and Flip\n\nNote : Callum and Nessie have reappeared."}],[{"episodeNumber":"1","title":"\"Wild Horse Heroes\"","location":"Patagonia","isPartOfDoubleEpisode":false,"description":" When a young foal goes missing from a herd of wild horses in Patagonia, Jett and Team Dizzy help a girl named Nayla go on a search and rescue mission in the mountains to find it.\nPackage item : A sketch book for Nayla\nWord of this episode : Bonito (Beautiful) in Spanish\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky) \n\nNote : Jimbo returns after his trip around the world, this time at a new function at the World Airport, this time taking care of the hangar of the new members of Super Wings."},{"episodeNumber":"2","title":"\"Treehouse Trouble\"","location":"The  Rocky Mountains","isPartOfDoubleEpisode":false,"description":" A young boy named Daniel in B.C. Canada asks Jett to bring him a tool kit to help him build a treehouse for his dad. The treehouse is a success but a melting glacier causes a flood of the nearby river and the Super Wings have to think fast to save the day – and the treehouse.\nPackage item : A heavy duty plastic hammer for Daniel\nWord & Phrase of this episode : Fantastique (Fantastic) & Bonne Chance (Good Luck) in Canadian French\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop and Remi)\n\nNote : Like Sky, Daniel gave Jett the phrase mentioned here in both English and French."},{"episodeNumber":"3","title":"\"Baursaki Blast-Off\"","location":"Kazakhstan","isPartOfDoubleEpisode":false,"description":" A young boy named Maxim in Kazakhstan gets Jett to bring him a package of Kazakh doughnuts so he can give them to his mom, an astronaut who is traveling to the moon; when she blasts off without them, Astra's Galaxy Wings is called upon to help.\nPackage item : A box of baursaki (Kazakh doughnuts) for Maxim's mom\nWord of this episode : дәмді (\"Damdi\"; Delicious) in Kazakh\n\nSuper Wings helping team : Galaxy Wings (Astra, Astro & Rover)"},{"episodeNumber":"4","title":"\"Lost In the Everglades\"","location":"/ Florida","isPartOfDoubleEpisode":false,"description":" When a toy jet gets blown off course and becomes lost in the Everglades, an impossible place to find anything, it seems like the young boy who owns it will never get it back; Jett calls Mira's Wild Team for assistance.\nPackage item : A stunt pilot's helmet for Juanito\nWord of this episode : Atrevido (Daring) in Spanish\nSuper Wings helping team : Wild Team (Mira, Swampy & Willie) \n\nNote : Although they are absent this season, Jerome and Grand Albert make a small appearance at the start of the episode."},{"episodeNumber":"5","title":"\"The Case of the Lost Suitcase\"","location":"Amsterdam","isPartOfDoubleEpisode":false,"description":" A young girl named Tess is excited go to Schiphol Airport in her hometown of Amsterdam, where she will be going on her first airplane ride; Jett brings her a carry-on suitcase, but trouble arises when it goes missing.\nPackage item : A bear-like carry-on suitcase for Tess\nWord of this episode : Opgewonden (Excited) in Dutch\nSuper Wings helping team : Police Patrol (Paul, Kim & Badge) \n\nNote : Although Big Wing is absent in this season, it can be seen in this episode a large aircraft similar to him (or possibly himself)."},{"episodeNumber":"6","title":"\"Hot Spring Helpers\"","location":"Nagano","isPartOfDoubleEpisode":false,"description":" A mishap clogs a hot spring in Nagano, Japan, causing several new hot springs to appear; Donnie's Build-It Buddies turn the calamity into a great new water park for both people and snow monkeys to enjoy.\nPackage item : A basket of eggs for Tomo\nWord of this episode : 温泉 or おんせん (\"Onsen\"; Hot Spring) in Japanese\n\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop & Remy)"},{"episodeNumber":"7","title":"\"Webcaster Disaster\"","location":"Busan","isPartOfDoubleEpisode":false,"description":" A virus disrupts a computer that is needed for a popular webcast that a girl named Yuna in Busan, South Korea, does with her father, to get the live stream back up and running, Jett and the Galaxy Wings go into the computer and vanquish the virus.\nPackage item : A high-speed train toy for Yuna\nWords of this episode : 쿨 & 굉장 (\"kul & goengjang\"; Cool & Awesome) in Korean (Busan dialect)\nSuper Wings helping team : Galaxy Wings (Astra, Astro & Rover)\n\nNote : With this delivery in Busan, South Korea is the second most visited country by Jett and the Super Wings to this day in all seasons (China is still the country that has been visited by the Super Wings to this day)."},{"episodeNumber":"8","title":"\"Fun in the Philippines\"","location":"Olango Island Group","isPartOfDoubleEpisode":false,"description":" Three Filipina sisters named Trudis, Judith and Analyn ask Jett to deliver some mics and a stand so they can participate in a singing concert; when they are late setting out for the concert, it's a race against time to get them on stage.\nPackage items : Three microphones & one stand for Trudis, Judith, & Analyn\nWord of this episode : Maganda (Beautiful) in Filipino\n\nSuper Wings helping team : Wild Team (Mira, Swampy & Willie)"},{"episodeNumber":"9","title":"\"Duck Drama\"","location":"Battambang","isPartOfDoubleEpisode":false,"description":" Jett flies to Battambang, Cambodia, to deliver a duck whistle to a girl named Solyna so she can help her parents herd their ducks into a truck; when the ducks escape, Sky scrambles Paul's Police Patrol to help track down the waddling wildlife.\nPackage item : A duck whistle for Solyna\nWord of this episode : ដ៏អស្ចារ្យ (\"Aschar\"; Amazing) in Khmer\n\nSuper Wings helping team :  Police Patrol (Paul, Kim & Badge)"},{"episodeNumber":"10","title":"\"Ups and Downs\"","location":"Trier","isPartOfDoubleEpisode":false,"description":" When a girl named Louisa in Germany goes to visit her favorite amusement park, she's sad to learn that it is being closed forever; the Super Wings work to give the park a makeover and a whole new lease on life.\nPackage item : A headband for Louisa\nWord of this episode : Schnell (Fast) in German\n\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop & Remi)"},{"episodeNumber":"11","title":"\"Cosmic Slam Dunk\"","location":"Madrid","isPartOfDoubleEpisode":false,"description":" Jett delivers new basketball shoes to a boy named Manu in Spain who hopes that the shoes will allow him to dunk; when the shoes don't work, Jett and the Galaxy Wings take Manu to Mars, where the lack of gravity should allow him to dunk like a champ.\nPackage item : A pair of basketball shoes for Manu\nWord of this episode : Fantástico (Fantastic) in Spanish\nSuper Wings helping team : Galaxy Wings (Astra, Astro & Rover)\n\nNote : Vo reappears in this episode."},{"episodeNumber":"12","title":"\"Shark Surf Surprise\"","location":"Gold Coast","isPartOfDoubleEpisode":false,"description":" Jett delivers a surfboard to a girl named Clara who lives on Australia's Gold Coast; Mira's Wild Team is called in to teach Clara to surf, but everyone gets more than they bargained for when they also help rescue a shark.\nPackage item : A surfboard for Clara\nWord of this episode : Ace (Excellent) in Australian English\nSuper Wings helping team : Wild Team (Mira, Swampy & Willie)\n\nNote : For the word in this episode, you say \"ice\" in this case."},{"episodeNumber":"13","title":"\"Big Bug Problem\"","location":"Paris","isPartOfDoubleEpisode":true,"description":" Grand Albert's Telephoto Transformer is mistakenly delivered to a boy named Marcel who lives in Paris. When the camera makes a beetle named hugo grow into a giant insect it's up to Jett and Dizzy's Rescue Riders to save the city and the Eiffel Tower and shrink the beetle back to normal size.\nPackage item : A camera for Marcel (with an extra item)\nWord of this episode : Rapidement (Quickly) in French\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)\nNote 1 : This episode has 2 parts to it.\n\nNote 2 : Martine and her dad from Season 1 (Episode #19), Cian, Aidan and their father from Season 2 (Episode #64) made their cameo appearances here."},{"episodeNumber":"14","title":"\"Big Bug Problem\"","location":"Paris","isPartOfDoubleEpisode":true,"description":" Grand Albert's Telephoto Transformer is mistakenly delivered to a boy named Marcel who lives in Paris. When the camera makes a beetle named hugo grow into a giant insect it's up to Jett and Dizzy's Rescue Riders to save the city and the Eiffel Tower and shrink the beetle back to normal size.\nPackage item : A camera for Marcel (with an extra item)\nWord of this episode : Rapidement (Quickly) in French\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)\nNote 1 : This episode has 2 parts to it.\n\nNote 2 : Martine and her dad from Season 1 (Episode #19), Cian, Aidan and their father from Season 2 (Episode #64) made their cameo appearances here."},{"episodeNumber":"15","title":"\"Underground City\"","location":"Cappadocia","isPartOfDoubleEpisode":false,"description":" Jett delivers a hamster exercise ball to a girl named Sachi who lives in Cappadocia, Turkey; her pet hamster escapes in the ball and the Super Wings must try to find the hamster in the underground city of Derinkuyu.\nPackage item : A hamster exercise ball for Sachi's hamster, Emir\nWord of this episode : Özel (Special) in Turkish\n\nSuper Wings helping team : Police Patrol (Paul, Kim & Badge)"},{"episodeNumber":"16","title":"\"Camp Fjord\"","location":"Oslo & Geirangerfjord","isPartOfDoubleEpisode":false,"description":" Jett brings a selfie stick to a boy named Anders in Norway; Jett joins Anders on a camping trip with his father, but things take a strange turn when beavers disrupt their campsite and Jett accidentally destroys the beavers' dam.\nPackage item : A selfie stick for Anders\nWord of this episode : Appelsin (Orange) in Norwegian\n\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop & Remi)"},{"episodeNumber":"17","title":"\"Maeklong Market Madness\"","location":"Bangkok","isPartOfDoubleEpisode":false,"description":" A girl named Corissa from Bangkok, Thailand, orders a baby carriage to take her kitten in to a famous local market. Chaos ensues when the cat escapes but Dizzy's Rescue Riders arrive to help save the day.\nPackage item : A cat carriage for Corissa's kitten, Tiida\nWord of this episode : ไม่ว่าง (\"Mị̀ ẁāng\"; Busy) in Thai\n\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)"},{"episodeNumber":"18","title":"\"Sandcastle Superstar\"","location":"Mont-Saint-Michel","isPartOfDoubleEpisode":false,"description":" Loic, a boy who lives on Mont-St-Michel in France, wants to build the biggest and best sandcastle ever; with help from Jett and the Build-It Buddies, Loic might just see that dream come true – if they can save the sandcastle from a giant wave.\nPackage item : Sand castle molds for Loic\nPhrase of this episode : Très bien (Very good) in French\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop & Remy)\n\nNote : Big Wing makes a small appearance."},{"episodeNumber":"19","title":"\"The Show Must Go On\"","location":"Xi'an","isPartOfDoubleEpisode":false,"description":" When a girl named Ling Ling in China gets the role of the Monkey King in a Beijing Opera, Jett delivers a Monkey King's magical staff. The staff proves tricky to use however, and it's soon up to the Super Wings to help save the show.\nPackage item : A Monkey King's magical staff for Ling Ling\nWord of this episode : 驕傲 (\"Jiāo ào\"; Proud) in Mandarin Chinese\n\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)"},{"episodeNumber":"20","title":"\"Backpack for Baraka\"","location":"Kenya","isPartOfDoubleEpisode":false,"description":" Jett and the Build-It Buddies help a young Kenyan boy named Baraka rescue scared animals stranded by a rising river. As the team hurries to get Baraka to school on time, he worries he has nothing to show his classmates for show and tell.\nPackage item : A new backpack for Baraka\nWord of this episode : Asante (Thank you) in Swahili\n\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop & Remi)"},{"episodeNumber":"21","title":"\"Constellation Situation\"","location":"Tuscany","isPartOfDoubleEpisode":false,"description":" A girl named Galilea who lives in Tuscany loves the constellations that appear in the night sky; she has even discovered one of her own and has made up a story about it that she is going to tell to her friends under the stars.\nPackage item : A star constellation lamp for Galilea\nPhrase of this episode : è fantastico (That's great) in Italian\n\nSuper Wings helping team : Galaxy Wings (Astra, Astro & Rover)"},{"episodeNumber":"22","title":"\"Moscow Metro\"","location":"Moscow","isPartOfDoubleEpisode":false,"description":" Jett brings a basket to a boy named Huddin in Moscow, so he can deliver some special bread to his mom, who is in the hospital. However, Jett needs the help of Paul's Police Patrol when the basket of bread gets left on a subway car.\nPackage item : A bread basket for Huddin\nWord of this episode : удачи (\"Udachi\"; Good Luck) in Russian\nSuper Wings helping team : Police Patrol (Paul, Kim & Badge)\nNote 1 : Fred returns to World Airport again, in order to get fuel for himself.\n\nNote 2 : Stig and his father from Season 1 (episode #43) made their cameo appearances."},{"episodeNumber":"23","title":"\"Margaret Island Menagerie\"","location":"Budapest","isPartOfDoubleEpisode":false,"description":" Jett delivers a Hungarian Gypsy Fiddle to a girl named Petra in Budapest. Petra takes it to an amazing island named Margaret Island, but the animals in the petting zoo there are entranced by the music and begin to follow her everywhere.\nPackage item : A gypsy fiddle for Petra\nPhrase of this episode : Ez érdekes (That's interesting) in Hungarian\n\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)"},{"episodeNumber":"24","title":"\"Food Truck Ruckus\"","location":"/ Portland","isPartOfDoubleEpisode":false,"description":" Jett delivers a cooking kit to a boy named Juni in Portland, U.S. and helps him make tofu rice burgers in his family's food truck. Dizzy's Rescue Raiders arrive to help as they have too many customers and a burnt patty sets a bush on fire.\nPackage item : A set of cooking utensils for Juni\nPhrase of this episode : Yes, Chef.\n\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)"},{"episodeNumber":"25","title":"\"Olivia the Brave\"","location":"/ London","isPartOfDoubleEpisode":false,"description":" Jett delivers a lion costume to a girl named Olivia in London, England. She is easily startled and hopes that the costume will make her brave like her favorite book character, a courageous lion.\nPackage item : An \"Albert the Brave\" costume for Olivia\nWord of this episode : Brill (Cool) and Cheerio (Goodbye) in British English\nSuper Wings helping team : Police Patrol (Paul, Kim & Badge)\n\n\nNote : Like Sky, Jett gave himself the phrase mentioned at World Airport in British English and English."},{"episodeNumber":"26","title":"\"Seeing the Light\"","location":"Cape Horn","isPartOfDoubleEpisode":false,"description":" Jett calls in Paul and his Police Patrol pals to help a little girl named Isabella celebrate her birthday in one of the loneliest, most remote locations in the world.\nPackage item : A birthday cake with candles for Isabella\nWord of this episode : Buena onda (Cool) in Spanish\nSuper Wings helping team : Police Patrol (Paul, Kim & Badge)\n\nNote : Tippy from Season 2 (Episode #58) have reappeared."},{"episodeNumber":"27","title":"\"Puppies at the Ball\"","location":"/ England","isPartOfDoubleEpisode":false,"description":" Princess Maribelle in England is excited about her five dogs attending a royal ball in fancy costumes that Jett delivers. When a prince attending the ball is scared of the dogs, Jett volunteers to puppy-sit, but the dogs escape.\nPackage items : Five formal dog costumes for Princess Maribelle's five puppies\nWord of this episode : Posh (Fancy) in British English\nSuper Wings helping team : Police Patrol (Paul, Kim & Badge)\n\nNote : Jett returns to see Princess Maribelle again from Season 1 (Episode #5)."},{"episodeNumber":"28","title":"\"Searching for Manta Ray\"","location":"Palau","isPartOfDoubleEpisode":false,"description":" A boy named Ray who lives in Palau, South Pacific, wants to see a Manta Ray in the wild. Jett and the Wild Team do their best to help him find one, but end up trapped in a Blue Hole.\nPackage item : A Pop-up book about Sea Creatures for Ray\nWord of this episode : Mechikung (Goodbye) in Palauan\n\nSuper Wings helping team : Wild Team (Mira, Swampy & Willie)"},{"episodeNumber":"29","title":"\"Missing in Morocco\"","location":"Fez","isPartOfDoubleEpisode":false,"description":" While on his way to deliver a package to a boy named Omar, Jett gets stuck in quicksand in the Sahara desert. Worried that Jett is overdue, Omar contacts Sky, and Paul's Police Patrol is sent.\nPackage items : A police uniform and equipment for Omar\nWord of this episode : لنتحرك (\"Lanataharak\"; Let's move) in Arabic\nSuper Wings helping team : Police Patrol (Paul, Kim & Badge)\nNote 1 : The package was delivered to Omar by a mailman from the Camel Express.\n\nNote 2 : With his knowledge about the Super Wings, Omar could become a new human member of World Airport in the future."},{"episodeNumber":"30","title":"\"Pajama Party\"","location":"New Delhi","isPartOfDoubleEpisode":false,"description":" Jett delivers a giant Snakes and Ladders game to Anita who is having a pajama party with her friends. To complete a game challenge, Donnie's Build-It Buddies turn Anita's bed into a princess' carriage.\nPackage item : A Snakes and Ladders board game for Anita\nPhrase of this episode : कितना मज्जेदार (\"Kitana majjedaar\"; How fun) in Hindi\n\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop & Remi)"},{"episodeNumber":"31","title":"\"Abu Dhabi Thunder\"","location":"Abu Dhabi","isPartOfDoubleEpisode":true,"description":" Jett delivers a costume to a boy named Nav in Abu Dhabi. Jack wears it to an Air Show starring his favorite plane, Thunder. When Thunder gets damaged during the competition, Jack and Jett must take his place and try to fly to victory.\nPackage item : A Thunder costume for Nav\nWord of this episode : السلامه (\"Salameh\"; Safety) in Arabic\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)\nNote 1 : This episode has 2 parts to it.\nNote 2 : Jerome and Grand Albert made their appearances. Jerome, along with his sister and brother, formed a team called \"Team Jerome\".\nNote 3 : Grand Albert was one of three judges for the event. Jimbo was the play-by-play announcer here.\n\nNote 4 : Unlike Jerome, his siblings don't turn into robots. The reason for this is unknown."},{"episodeNumber":"32","title":"\"Abu Dhabi Thunder\"","location":"Abu Dhabi","isPartOfDoubleEpisode":true,"description":" Jett delivers a costume to a boy named Nav in Abu Dhabi. Jack wears it to an Air Show starring his favorite plane, Thunder. When Thunder gets damaged during the competition, Jack and Jett must take his place and try to fly to victory.\nPackage item : A Thunder costume for Nav\nWord of this episode : السلامه (\"Salameh\"; Safety) in Arabic\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)\nNote 1 : This episode has 2 parts to it.\nNote 2 : Jerome and Grand Albert made their appearances. Jerome, along with his sister and brother, formed a team called \"Team Jerome\".\nNote 3 : Grand Albert was one of three judges for the event. Jimbo was the play-by-play announcer here.\n\nNote 4 : Unlike Jerome, his siblings don't turn into robots. The reason for this is unknown."},{"episodeNumber":"33","title":"\"The Good Doctor\"","location":"Serengeti National Park","isPartOfDoubleEpisode":false,"description":" Jett gives a vet kit to a boy named Adika in Tanzania; and responds to a field call to rescue an elephant in the middle of the road.\nPackage items : A toy veterinarian kit, with a lab coat, for Adika\nWord of this episode : Lo (Wow) in Swahili\n\nSuper Wings helping team :  Build-It Buddies (Donnie, Scoop & Remi)"},{"episodeNumber":"34","title":"\"Big Swiss Clean Up\"","location":"Grindelwald","isPartOfDoubleEpisode":false,"description":" Robin and his family owned a guest house. They were preparing their inexpensive hotel for guests that were coming for a snow festival. Jett was helping Robin clean one of the rooms, when the vacuum cleaner broke down. After the Build-It Buddies arrived at the house, they created a replacement one for Robin to use. It worked fine, but it was too powerful for Robin to handle. As a result, the vacuum cleaner was picking up everything and getting bigger at the same time. The Super Wings used fondue to stop it from destroying the snow sculptures. However, it spat out a huge cheese ball and it was flying toward the guest house. How can the Super Wings stop the ball from destroying the house?\nPackage item : A toy vacuum cleaner for Robin\nWord of this episode : Tolle (Amazing) in German\n\nSuper Wings helping team :  Build-It Buddies (Donnie, Scoop & Remy)"},{"episodeNumber":"35","title":"\"Mykonos Marriage Magic\"","location":"Mykonos","isPartOfDoubleEpisode":false,"description":" Christo's father is marrying Sophie. The marriage ceremony gets underway as planned, but trouble arises when a pelican snatches the wedding ring from Christo. Jett tried to retrieve it from the bird, but it fell into the bottom of the sea. After the Wild Team arrives at the scene, Christo and the Super Wings go underwater, in order to look for the ring. They find it, but it got away from them by a flounder that can hide below the sea floor. To make things worse, a different school of fish was protecting one of their own kind that has the ring. Can Jett and the Super Wings figure out a way to get it from them?\nPackage item : A wedding ring for Christo (actually, it is for Sophie: his new stepmother)\nWord of this episode : Ώπα (Opa!) (A Greek emotional expression)\nSuper Wings helping team : Wild Team (Mira, Swampy & Willie)\n\nNote : At the beginning of the episode, there is a dance performance. The characters participating in this performance are (in order of appearance): Jett, Paul, Mira, Kim, Roy, Jimbo, Donnie, Scoop and Remi."},{"episodeNumber":"36","title":"\"Maple Syrup Surprise\"","location":"/ Gaspésie","isPartOfDoubleEpisode":false,"description":" Manon and her family just moved in to their new home at the Gaspé Peninsula. They are preparing to go to a local maple syrup festival, in order to meet their new neighbors. Manon wanted to make maple candies for the festival, but she does not have the proper equipment to make that happen. Even more so, she needed a lot of sap for making the candies. After the Build-It Buddies arrive and created a boiler for the sap, Manon was ready to create her first maple syrup candies. However, Donnie opened the boiler's tap too much and created a big and sticky mess. How are Manon and the Super Wings supposed to use all the sap without wasting a drop of it?\nPackage items : A maple tree tap and a bucket for Manon\nWord of this episode : Génial (Great) in French\n\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop & Remy)"},{"episodeNumber":"37","title":"\"Send in the Drones\"","location":"Seoul and World Airport","isPartOfDoubleEpisode":false,"description":" Neo introduced a new set of super drones that can deliver packages all over the world to Jett and company. Jett, however, has major doubts about the whole idea. His fears were confirmed, when all the drones in the delivery depot started to malfunction. As a result, the World Airport complex was in lockdown. Can Jett save the World Airport's reputation and get to Si-hoo (with the items) on time?\nPackage items : A toy race vehicle and its remote control for Si-hoo\nWord of this episode : 정지 (\"Jeongji\", Stop) in Korean\nSuper Wings helping team : Police Patrol (Paul, Kim & Badge)\nNote 1 : Unfortunately, Si-hoo first received an empty box from a delivery drone. \n\nNote 2 : With this episode, Seoul becomes one of the only cities within the series to be visited on more than one occasion (Seoul (2x): \"Family Time\" and \"Send in the Drones\", Tokyo (2x): \"Paper Rangers\" and \"Cat in the Box\", Paris (2x): \"A Winning Recipe\" and \"Big Bug Problem\", Moscow (2x): \"Balancing Act\" and \"Moscow Metro\", Bangkok (2x): \"Boonying's Bath Time and \"Maeklong Market Madness\", London (3x): \"Rain Ride\", \"Junior Detective\" and \"Olivia the Brave\", an unnamed city in England (2x): \"Puppies for a Princess\" and \"Puppies at the Ball\" (Both deliveries went to Princess Maribelle) and an unnamed city in Scotland (2x): \"Bubble Trouble\" and \"Loch Ness in Ice\" (Both deliveries went to Callum)."},{"episodeNumber":"38","title":"\"Eye on the Sky\"","location":"Atacama Desert","isPartOfDoubleEpisode":false,"description":" The Galaxy Wings demonstrated what a black hole was and looked like to Jett. They also explained to Jett the opposite of a black hole: A white hole. After Jett arrived at an observatory in the desert, both he and Catalina saw that Vo, the Rover, was on an asteroid from a telescope. Once the Super Wings and Catalina had successfully landed on that asteroid, they find Vo. The reason Vo was on the asteroid was to go to Earth and visit Catalina. However, Astro saw that they were headed toward a black hole. They could not escape from its gravitational pull and ended up being trapped inside it. How are they going to escape from this predicament?\nPackage item : A friendship bracelet for Catalina\nPhrase of this episode : No lo sé (I don't know) in Spanish\nSuper Wings helping team : Galaxy Wings (Astra, Astro & Rover)\nNote 1 : Jett got to see both Catalina and Vo again, from Season 2 (Episode #79).\n\nNote 2 : Vo loses her doll that Catalina gave it in the black hole from the same previous episode."},{"episodeNumber":"39","title":"\"A Bueno Burrito\"","location":"Guanajuato City","isPartOfDoubleEpisode":false,"description":" Victor wants to have his own guitar, in order to play it with his friends. However, in order to get one from his mother, Victor must complete 10 different chores in the house and out in the city. Jett agreed to assist Victor complete these chores. Time is against both guys because Victor wants to get that guitar immediately. With the Super Wings' help, the final chore to finish was to get the ingredients to make homemade burritos. After all the shopping they did in the city centre, the only items they need was some tortillas. Unfortunately, the bakery's tortilla-making machine broke down. Victor found out why: one of the machine's conveyor belts was ripped. Once the machine was fixed, Jett added too much tortilla dough to it. Zoey tried to turn it off, but the power lever broke in half and she could not stop it. As a result, the raw dough was so big, it pushed everyone out of the store and sent them flying in the air. How is Victor going to get his guitar, if he cannot receive any fresh tortillas now?\nPackage item : A sticker book for Victor\nWord of this episode : Bueno (Good) in Spanish\n\nSuper Wings helping team : Rescue Riders (Dizzy, Zoey & Sparky)"},{"episodeNumber":"40","title":"\"Kiwifruit Catastrophe\"","location":"New Zealand","isPartOfDoubleEpisode":false,"description":" Kate is volunteering at Farmer Wilson's kiwifruit farm, in order to pick some fresh kiwifruit from the trees there. Unfortunately, there was not enough rain to grow any proper-sized kiwifruit. After the Super Wings arrive at the scene, they create a water pump and sprayed some water to the tree groves. However, the kiwifruit would need a few weeks to grow into their proper sizes. Donnie suggests an idea of using fertilizer to speed up the growing process. Once Donnie gets a hold of some bags of fertilizer, he uses too much of it, by pouring three big bags of it into the water pump. As the result, the kiwifruit grew into oversized giant ones and creating an avalanche of them. Can they find a way to collect them all safely?\nPackage items : A padded picking bag and a pair of cotton gloves for Kate\nWord of this episode : Choice (Great) in New Zealand English\n\nSuper Wings helping team : Build-It Buddies (Donnie, Scoop & Remi)"}],[{"episodeNumber":"1","title":"\"Fuzzy Alpaca Furballs\"","location":"Cusco","isPartOfDoubleEpisode":false,"description":" A delivery of grooming supplies to Alenca goes awry, when the three alpacas being groomed get scared and roll away after being dried.\nPackage items : Hair dyes and a grooming kit for Alenca\nWords of this episode : Napaykullayki (Hello) in Quechua and Muy Hermoso (Very Beautiful) in Spanish\n\nSuper Wings travel buddy : Dizzy"},{"episodeNumber":"2","title":"\"Guangzhou Lightshow\"","location":"Guangzhou","isPartOfDoubleEpisode":false,"description":" Cici's cat created some chaos at a light show in the Chinese city of Guangzhou.\nPackage item : An Emoji laser pointer for Cici\nPhrase of this episode : 一起玩吧 (\"yīqǐ wán ba\"; Let's have fun together) in Mandarin Chinese\n\nSuper Wings travel buddy : Paul"},{"episodeNumber":"3","title":"\"Car Factory Chaos\"","location":"/ Montgomery","isPartOfDoubleEpisode":false,"description":" A car factory nearly goes down in ruins, when a car is built with big monster truck wheels on Father's Day.\nPackage item : A set of car decals for Kevin\nWords of this episode : Y'all (a contraction of you and all) in Southern American English\n\nSuper Wings travel buddy : Donnie"},{"episodeNumber":"4","title":"\"Chimpanzee Choo Choo\"","location":"Yaoundé","isPartOfDoubleEpisode":false,"description":" A toy train soon proves to be troublesome, when a pet chimpanzee drives it far into the jungle.\nPackage item : A model train for Cynthia's Chimpanzee, Cimba\nWord of this episode : Félicitations (Congratulations) in French\n\nSuper Wings travel buddy : Dizzy"},{"episodeNumber":"5","title":"\"The Snow Princess\"","location":"Røros","isPartOfDoubleEpisode":false,"description":" A new Super Wing named Crystal comes to the rescue, when a town play almost gets postponed because of an excess accumulation of snow.\nPackage item : A dress that shoots out fake snow for Alice\nWord of this episode : Fantastisk (Amazing) in Norwegian\nSuper Wings travel buddy : Donnie\n\nNew Super Wings helper : Crystal"},{"episodeNumber":"6","title":"\"Pig Out\"","location":"St. Gallen","isPartOfDoubleEpisode":false,"description":" It proves to be a big problem, when five pigs in a pig race are distracted by the scent of gingerbread cookies, causing a food truck to run amok in a giggling fit.\nPackage item : A Gingerbread-scented gingerbread man costume for Teri\nWord of this episode : Lecker (Yummy) in Swiss German\n\nSuper Wings travel buddy : Paul"},{"episodeNumber":"7","title":"\"Don't Burst My Bubble\"","location":"The  Galápagos Islands","isPartOfDoubleEpisode":false,"description":" Jett and Mira must work fast, when super strong bubbles capture various sea creatures from a beach. Things get more complicated, when an female orca strands itself on the same beach shore.\nPackage item : A bubble wand for Jeremy \nWord of this episode : Fuerte (Strong) in Spanish\n\nSuper Wings travel buddy : Mira"},{"episodeNumber":"8","title":"\"Bulgarian Bee Buzz\"[6]","location":"Kazanlak","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy deliver a water sprayer to Sylvia. They'll need help from a new insect Super Wing named Bucky, when a water fight and subsequent mud splash on a beehive, causes the bees to get angry at them.\nPackage item : A water sprayer with multiple nozzles for Sylvia\nWord of this episode : красив (\"Krasiv\"; Beautiful) in Bulgarian\nSuper Wings travel buddy : Dizzy\n\nNew Super Wings helper : Bucky"},{"episodeNumber":"9","title":"\"The Muddier The Merrier\"","location":"Boryeong","isPartOfDoubleEpisode":false,"description":" Jett and Mira deliver a special suit to a child named Gio, who hates getting dirty. As such, he can join his parents at the Boryeong Mud Festival. Unfortunately, the suit malfunctions during the festivities, causing him to bounce around town and out of control.\nPackage item : An inflatable protective suit for Gio\nWord of this episode : 신난다 (\"Sinnanda\", Exciting) in Korean\nSuper Wings travel buddy : Mira\n\nSuper Wings helper : Willie"},{"episodeNumber":"10","title":"\"Noah's Dinosaur Eggs\"","location":"Copenhagen","isPartOfDoubleEpisode":false,"description":" Noah orders three egg cases, in order to house the baby block dinosaurs he made to give to their respective mothers. However, chaos ensues at the dinosaur theme park, when the babies end up mistakenly imprint on Jett as their mother. As the result, this situation enrages the would-be mother dinosaurs.\nPackage items : Three block dinosaur eggshells for Noah\nWord of this episode : Interessant (Interesting) in Danish\nSuper Wings travel buddy : Donnie\n\nNote : Noah returns here, from Season 1 Episode #29 & Season 2 Episode #44."},{"episodeNumber":"11","title":"\"Where Do You Go For A U.F.O.?\"","location":"Wycliffe Well","isPartOfDoubleEpisode":false,"description":" A UFO hunt leads to a rescue mission, when a satellite named Orbit crashes in the Australian Outback. The hard part is trying to send him back into orbit and deal with the meteor shower that caused his crash in the first place.\nPackage item : A miniature satellite dish for Mason\nWord of this episode : Stoked (Really Excited) in Australian English\nSuper Wings travel buddy : Astra\n\nSuper Wings helper : Rover"},{"episodeNumber":"12","title":"\"Floating Fruit Fun\"","location":"Amphawa","isPartOfDoubleEpisode":false,"description":" An ordinary birthday cake delivery goes awry, when it attracts some of the hungry wildlife wanting the fruit that is covering it.\nPackage item : A colossal birthday cake for Phra's aunt, Achara\nPhrase of this episode : สุขสันต์วันเกิด (\"S̄uk̄hs̄ạnt̒ wạn keid\"; Happy Birthday) in Thai\n\nSuper Wings travel buddy : Mira"},{"episodeNumber":"13","title":"\"Doll Daze\"","location":"The  Netherlands","isPartOfDoubleEpisode":false,"description":" When Jett and Bucky deliver a new dress for Nina's doll, they quickly found out that a mother vole a field mouse was taking Nina's things, so that her baby vole could have a tea party.\nPackage item : A doll-sized dress for Nina's doll\nWord of this episode : Dank je (Thank You) in Dutch\n\nSuper Wings travel buddy : Bucky"},{"episodeNumber":"14","title":"\"Moai Fly By\"","location":"Easter Island","isPartOfDoubleEpisode":false,"description":" Kalama orders three large propeller caps, so her favorite Moai statues could keep cool in the hot weather. However, the caps blew so much wind that they send the Moai flying in the sky and all across Easter Island.\nPackage items : Three giant propeller beanies for Kalama's buddies: The Moai statues\nWord of this episode : Compadres (Buddies) in Spanish\n\nSuper Wings travel buddy : Dizzy"},{"episodeNumber":"15","title":"\"Tractor Triumph\"","location":"/ Scotland","isPartOfDoubleEpisode":false,"description":" Jett and Donnie deliver a football uniform for Rooney to give his friend, Jack the Tractor, who is participating in a tractor football game.\nPackage item : A football uniform for Jack the Tractor\nWord of this episode : Tidy (Beautiful) in Scottish \n\nSuper Wings travel buddy : Donnie"},{"episodeNumber":"16","title":"\"Pacific Rim Roundup\"","location":"/ Hawaii","isPartOfDoubleEpisode":false,"description":" The Super Wings set off for Hawaii to deliver a special vacuum cleaner for Tyler, in order to clean up the sea.\nPackage item : A deep sea vacuum cleaner for Tyler\nWord of this episode : Mahalo (Thank You) in Hawaiian\nSuper Wings travel buddy : Mira  Super Wings helper : Willie\n\nNote : This is the only appearance of Jerome in Season 4."},{"episodeNumber":"17","title":"\"Paper Rangers Puppetry\"","location":"Tokyo","isPartOfDoubleEpisode":false,"description":" Jett and Donnie deliver large sheets of origami paper, in order to make a life-sized Jumbo Roboto for Paper-con. However, the Super Wings has to work fast, when the life-sized, remote controlled, Drac the Ripper, malfunctions during the stage show.\nPackage items : Large sheets of origami paper for Namiko, Masako, Yuki and Haru\nWord of this episode : コスプレ (\"Kosupure\"; Cosplay) in Japanese \nSuper Wings travel buddy : Donnie\n\nNote : Namiko, Masako, Yuki and Haru reappear, from Season 1 Episode #16."},{"episodeNumber":"18","title":"\"Mongolian Wheels\"","location":"Gobi Desert","isPartOfDoubleEpisode":false,"description":" Gaspard orders a large set of four off-road tires for his motorhome friend Enjo. They make their way through the Gobi Desert, but Enjo gets overconfident and scares away some sheep belonging to Nambayar: One of Jett's old friends from an earlier delivery. It is up to the Super Wings to roundup the sheep back to her and her father.\nPackage items : A set of four desert off-roading tires for Gaspard's motor home, Enjo\nWord of this episode : Баярлалаа (\"Bayarlalaa\"; Thank You) in Mongolian\nSuper Wings travel buddy : Donnie\nNote 1 : This is the first appearance of Grand Albert in Season 4.\n\nNote 2 : Nambayar and her dad reappear, from Season 1 Episode #10."},{"episodeNumber":"19","title":"\"Save World Aircraft\"","location":"The  Himalayas","isPartOfDoubleEpisode":true,"description":" Akas and Remi, the very first children to order their package from the Super Wings, call for a delivery of jumbo-sized art supplies. They need them to support their father on his mountain climbing expedition. Unfortunately, while Jett and Dizzy were delivering the art supplies, the World Aircraft crashes in the mountain range. All the Super Wings members together are the only ones who can save it from destroying a village.\nPackage item : A bundle of jumbo-sized art supplies for Akas and Remi\nPhrase of this episode : भाग्यले साथ दिओस् (\"Bhāgyalē sātha di'ōs\"; Good Luck) in Nepali\nSuper Wings travel buddy : Dizzy  Super Wings helpers : Crystal, Scoop, Donnie, Astro, Astra, Sparky, Paul and Mira\n\nNote : Akas and Remi reappear, from Season 1 Episode #1."},{"episodeNumber":"20","title":"\"Save World Aircraft\"","location":"The  Himalayas","isPartOfDoubleEpisode":true,"description":" Akas and Remi, the very first children to order their package from the Super Wings, call for a delivery of jumbo-sized art supplies. They need them to support their father on his mountain climbing expedition. Unfortunately, while Jett and Dizzy were delivering the art supplies, the World Aircraft crashes in the mountain range. All the Super Wings members together are the only ones who can save it from destroying a village.\nPackage item : A bundle of jumbo-sized art supplies for Akas and Remi\nPhrase of this episode : भाग्यले साथ दिओस् (\"Bhāgyalē sātha di'ōs\"; Good Luck) in Nepali\nSuper Wings travel buddy : Dizzy  Super Wings helpers : Crystal, Scoop, Donnie, Astro, Astra, Sparky, Paul and Mira\n\nNote : Akas and Remi reappear, from Season 1 Episode #1."},{"episodeNumber":"21","title":"\"Mural Mayhem\"","location":"Bogotá","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy deliver a painting drone to a Colombian girl named Ximena. However, when she is so focused on her mural, her jealous and trouble-making dog, Pepito, steals the drone controls. He then sends the drone on a painting frenzy in the city. The Super Wings need to grab both Pepito and the drone, so Ximena can finish her mural.\nPackage item : A painting quadcopter for Ximena\nWord of this episode : Gran Idea (Great Idea) in Spanish\n\nSuper Wings travel buddy : Dizzy"},{"episodeNumber":"22","title":"\"Fairy Tale Fracas\"","location":"Hanau","isPartOfDoubleEpisode":false,"description":" A German girl named Kirsten orders a long, blonde wig for the Brothers Grimm Fairy Tale Festival, so she can masquerade as Rapunzel. However, she keeps tripping over the wig. Therefore, Donnie creates a castle tower parade float for her and her friends to ride on. Unfortunately, after the Super Wings pick up Kirsten's friends, her wig gets blown away and jams a wheel on a dragon float in front of them. Then, it causes continually more chaos on the parade route towards the festival grounds.\nPackage item : A blonde long-haired Rapunzel wig for Kirsten\nWord of this episode : Wunderschönen (Beautiful) in German\n\nSuper Wings travel buddy : Donnie"},{"episodeNumber":"23","title":"\"The Missing Chapter\"","location":"Switzerland","isPartOfDoubleEpisode":false,"description":" Jett and Astra deliver to Mia a pre-release copy of Dylan the Masked Adventurer's newest book. However, the last chapter is missing! Later on, they meet up with the author, who reveals that he is actually a bit of a coward. When the last chapter's pages get blown away by the wind, the Super Wings gives chase, in order to get them all back.\nPackage item : A pre-production copy of Dylan's new book for Mia\nPhrase of this episode : Merci vilmal (Thanks a lot) in Swiss German\nSuper Wings travel buddy : Astra\n\nSuper Wings helper : Liberty"},{"episodeNumber":"24","title":"\"Czech Clock Commotion\"","location":"Prague","isPartOfDoubleEpisode":false,"description":" The Prague astronomical clock stops working properly, when the Super Wings arrive with Pavel. The reason is revealed, when the mother pigeon is trying to save her scared chick that is trapped inside the clock's gears.\nPackage item : A wristwatch with holographic Super Wing figurines for Pavel\nWord of this episode : Scholom vas (Good Luck) in Czech\n\nSuper Wings travel buddy : Bucky"},{"episodeNumber":"25","title":"\"Balloon Train\"","location":"Cape Town and Pretoria","isPartOfDoubleEpisode":false,"description":" Jett and Paul deliver self-inflating party balloons to Bundila, so that he can give them, as a birthday present, to his friend Kungawo. Unfortunately, the train they are in is stopped by zebras on the tracks. On top of that, several other animals enter the train because they are lured by the smell of food coming from the dining car. As a result, they prematurely set off the balloons in the baggage car and send the train floating up to the sky. It is up to the Super Wings to save it and its passengers.\nPackage items : 100 self-inflating party balloon bundles for Bundila\nWord of this episode : Ugogo (Grandmother) in Zulu\n\nSuper Wings travel buddy : Paul"},{"episodeNumber":"26","title":"\"Dolphin Dilemma\"","location":"Bunbury","isPartOfDoubleEpisode":false,"description":" An Australian girl named Kate orders a specially-crafted underwater medical scanner. It is used to examine dolphins around her family's nature reserve. However, a young dolphin gets scared because it sensed an underwater earthquake. Later on, it is revealed that there is another dolphin stuck inside a shipwreck. Jett and Mira need to act fast to save the other dolphin, before the shipwreck sinks further downward.\nPackage item : A special underwater medical scanner for Kate\nWord of this episode : Hi, mate (Hello) in Australian English\nSuper Wings travel buddy : Mira \n\nSuper Wings helper : Willie"},{"episodeNumber":"27","title":"\"Halloween Havoc\"","location":"/ Long Beach","isPartOfDoubleEpisode":false,"description":" Jett and Donnie deliver a Super Wing costume to a kid named Allister, who needs it for trick-or-treating on Halloween. It does not take long, however, for Donnie to get scared by the decorations and costumes. Unfortunately, he gets scared and ends up having a pumpkin decoration covering his head. Things get even worse, when Donnie gets upgraded with his crazy tools, forcing Jett to rely on Kid Wing's help to catch him.\nPackage item : A Kid Wing costume for Allister\nWord of this episode : None\nSuper Wings travel buddy : Donnie \n\nSpecial Super Wings helper : Kid Wing"},{"episodeNumber":"28","title":"\"A Day at the Museum\"","location":"Cairo","isPartOfDoubleEpisode":false,"description":" Jett's and Paul's tour of the Cairo Museum goes wrong, when they get trapped inside with Ebony and her brother Noor. To make matters worse, Noor had earlier took a sceptre from one of the exhibits, causing the supercharge energy to bring some mummies, a statue and a sphinx to life.\nPackage item : A microphone and speaker unit, with a pop-out flag, for Ebony\nWord of this episode : قف (\"Qaf\"; Stop) in Arabic\nSuper Wings travel buddy : Paul\n\nSuper Wings helpers : (The Nightlight) Dart, Pouncer, Ruffrunner, Shadow, Goggles and Splattertail"},{"episodeNumber":"29","title":"\"Holo Heroes\"","location":"Icaria","isPartOfDoubleEpisode":false,"description":" Dennis and Shuan are boys who believe in their respective countries mythological figures. They order a holographic battle game that pits Chinese mythology creatures against ancient Greek mythology ones, in order to see which ones are the best fighters. Unfortunately, when they pit the Bull Demon King and the Minotaur against each other, both boys take out their power boost cards to win the game. Instead, the game malfunctions and bring the two creatures to life.\nPackage item : A holographic battle simulation card game for Dennis and Shuan\nWord of this episode : Yassas (Hello) in Greek\nSuper Wings travel buddy : Astra \n\nSuper Wings helper : Liberty"},{"episodeNumber":"30","title":"\"The Wild Wizard Wand\"","location":"/ Cardiff","isPartOfDoubleEpisode":false,"description":" A Welsh boy named Ryan orders a real magic wand. Since magic doesn't exist in the world, he receives instead a toy wand with a supercharged blue gemstone. Unfortunately, while trying it out at a wizard school day camp at Cardiff Castle, the wand causes all sorts of problems for the other students and the schoolmaster. Earlier, Jett did tell Ryan about reading the wand's warning label, before using it.\nPackage item : A supercharged toy magic wand for Ryan\nWord of this episode : Diolch (Thank You) in Welsh\nSuper Wings travel buddy : Dizzy \n\nSuper Wings helper : Sparky"},{"episodeNumber":"31","title":"\"A Rockin' Space Mission\"","location":"Moscow","isPartOfDoubleEpisode":true,"description":" Jett and Astra deliver a rock display case to a girl named Nika in Moscow. She aspires to have the best rock collection ever known on Earth. The only problem is that three of the rocks she needs in her collection are not on Earth. The three of them are located on the Moon, Mars and Saturn respectively.\nFirst, the Super Wings with Rover retrieved a moon rock, after dodging a meteor shower. Second, the group meets up with Vo on Mars. Along the way, they encounter a marsquake. After that, they got a Mars rock from Vo, to add to Nika's collection. The final part of the mission is for the group to go to Saturn. Once they arrive there, they get trapped in the rings of Saturn. To make things worse, all of Nika's other rocks gets mixed into the rings itself. With the help from the World Spacecraft, the Super Wings retrieve all of Nika's rocks, including a Saturn-shaped one. This accomplishment completes her rock collection.\nPackage item : A rock display case for Nika (Part 1) and three sets of giant chopsticks for retrieving all the rocks (Part 2)\nWord of this episode : Классно (\"Klassno\"; Awesome) in Russian \nSuper Wings travel buddy : Astra.\n\nSuper Wings helper : Rover"},{"episodeNumber":"32","title":"\"A Rockin' Space Mission\"","location":"Moscow","isPartOfDoubleEpisode":true,"description":" Jett and Astra deliver a rock display case to a girl named Nika in Moscow. She aspires to have the best rock collection ever known on Earth. The only problem is that three of the rocks she needs in her collection are not on Earth. The three of them are located on the Moon, Mars and Saturn respectively.\nFirst, the Super Wings with Rover retrieved a moon rock, after dodging a meteor shower. Second, the group meets up with Vo on Mars. Along the way, they encounter a marsquake. After that, they got a Mars rock from Vo, to add to Nika's collection. The final part of the mission is for the group to go to Saturn. Once they arrive there, they get trapped in the rings of Saturn. To make things worse, all of Nika's other rocks gets mixed into the rings itself. With the help from the World Spacecraft, the Super Wings retrieve all of Nika's rocks, including a Saturn-shaped one. This accomplishment completes her rock collection.\nPackage item : A rock display case for Nika (Part 1) and three sets of giant chopsticks for retrieving all the rocks (Part 2)\nWord of this episode : Классно (\"Klassno\"; Awesome) in Russian \nSuper Wings travel buddy : Astra.\n\nSuper Wings helper : Rover"},{"episodeNumber":"33","title":"\"Amazon Adventure\"","location":"Belém","isPartOfDoubleEpisode":false,"description":" Avelino's father orders an adventure uniform, with an attached life jacket, for his son. He wants his son to see that there is more action in the outside world than his constant video game playing. To do that, Jett and Mira join them on a father-son adventure in the Amazon rainforest.\nPackage item : An explorer's outfit, with a built-in lifejacket, for Avelino \nWord of this episode : Incrível (Incredible) in Portuguese \nSuper Wings travel buddy : Mira\nSuper Wings helper : Swampy\n\nNote : This is Mira and Swampy's last appearance in this episode."},{"episodeNumber":"34","title":"\"A Happy New Year Adventure\"","location":"Dezhou","isPartOfDoubleEpisode":false,"description":" For Chinese New Year, a girl named Siuwan orders an extra long-glowing dragon dance costume for a family reunion. However, when her mother tells Siuwan that the rest of the family is unable to come to the reunion on time, Jett calls for the deployment of the Super Wings Big Team, in order to save the family's New Year celebrations.\nPackage item : An extra long-glowing dragon dance costume for Siuwan and her family.\nWord of this episode : 新年快乐 (\"Xīnnián kuàilè\"; Happy New Year) in Mandarin \nSuper Wings travel buddy : Paul\nSuper Wings helpers : Willie, Badge, Remi and Sparky\n\nNote : This was Willie's last appearance until season 6 in this episode."},{"episodeNumber":"35","title":"\"Greenland Polar Playground\"","location":"/ Greenland","isPartOfDoubleEpisode":false,"description":" Jett and Crystal deliver a set of special ice molds to a girl in Greenland named Acacia. With the Super Wings help, Acacia is making an eco-friendly colored igloo, with a playground inside. Once done, the animals start to arrive towards the igloo, in order to play in there. Later on, trouble arises, when an iceberg threatens to destroy it completely.\nPackage item : A set of ice molds for Acacia that makes ice in eco-friendly colors.\nWord of this episode : Aluu (Hello) in Greenlandic \n\nSuper Wings travel buddy : Crystal"},{"episodeNumber":"36","title":"\"Bottle Boat Bon Voyage\"","location":"Porto","isPartOfDoubleEpisode":false,"description":" Nuno is a Portuguese child, who loves making model boats. In order to prevent his little brother, Lagos, from breaking his latest project, he orders an extremely durable impossible bottle. He would use it to place his ship model inside, with the help from Jett and Bucky. Unfortunately, Lagos begins fooling around with the bottle, with Nuno and the Super Wings trapped inside. As the result, they end up rolling outside Nuno's house, then go through the sewer system and finally onto the Douro river. As a bonus, they end up joining the annual Rabelo boat regatta.\nPackage item : An indestructible impossible bottle for Nuno \nWord of this episode : Adeus (Goodbye) in Portuguese \n\nSuper Wings travel buddy : Bucky"},{"episodeNumber":"37","title":"\"King Tan\"","location":"Kuala Lumpur","isPartOfDoubleEpisode":false,"description":" Jett and Donnie deliver a strong swing for a Malaysian girl named Suri. She ordered it for an orphaned orangutan named Tan. He lives at the zoo, where Suri's father works at. A chaotic misunderstanding from Jett causes an emergency release of the supercharge laser beam. As the result, Tan becomes a giant orangutan.\nPackage item : A strong swing for Suri's friend: Tan the orangutan\nPhrase of this episode : Terima kasih (Thank You) in Malay \nSuper Wings travel buddy : Donnie\n\nSuper Wings helper : Badge"},{"episodeNumber":"38","title":"\"Mexican Meow Mission\"","location":"Mexico","isPartOfDoubleEpisode":false,"description":" A Mexican girl, named Daniela, ordered special Marigold-shaped cat treats to her late cat Sánchez. A Mexican tradition states that dead people and pets, from the past, can come back to their loved ones on the Day of the Dead. In order to do that, the surviving family members use the Tagetes flowers to guide their ancestor's spirits back to them. Later on, the Super Wings, Dragons and Daniela somehow end up in another world or dimension. There, they meet Sánchez, who is now able to talk to them. However, a spirit of a stray cat is creating problems to every cat in this plane of existence. How are Daniela and the Super Wings supposed to get back to their world?\nPackage items : Marigold-shaped cat treats for Daniela\nWord of this episode : Saludos (Greetings) in Spanish \nSuper Wings travel buddy : Astra\nSuper Wings helpers : (The Rescue Riders) Burple, Aggro, Winger, Cutter, Summer, Melodia, Azymondias, Feathers, Dart, Pouncer, Ruffrunner, Shadow and Light Fury\n\nNote : This is the second appearance of Grand Albert in Season 4."},{"episodeNumber":"39","title":"\"Cricket Boat and Bowl\"","location":"Bangladesh","isPartOfDoubleEpisode":false,"description":" One of Jett's old friends, Ruma, orders a tabletop cricket game for her and her classmates on a floating school. Unfortunately, the school is too small for playing regular-sized cricket. When the tabletop version of the game proves to be too small for everyone, Jett and Dizzy decided to make a cricket pitch out of nearby spare rafts. What everyone did not know is that the makeshift pitch ends up blocking the river's central area for the other boats to use. How would the children play cricket now?\nPackage item : A tabletop cricket game for Ruma's floating school\nWord of this episode : গামা (\"Gāmā\"; Awesome) in Bengali \nSuper Wings travel buddy : Dizzy\nSuper Wings helper : Astra\n\nNote : Ruma reappears, from Season 1 Episode #44."},{"episodeNumber":"40","title":"\"Cotton Candy Catastrophe\"","location":"Toulouse","isPartOfDoubleEpisode":false,"description":" Jett and Donnie deliver a special cotton candy machine to a boy named Olivier. He and his father plan on serving vegetarian animal confections at their booth in a world culture fair. Unfortunately, one of the customers ordered a particularly large Earth-shaped treat that ends up creating chaos in the fair grounds.\nPackage item : A cotton candy machine for Olivier that can make cotton candy out of vegetables\nWord of this episode : Bonne idée (Good idea) in French \nSuper Wings travel buddy : Donnie\n\nSuper Wings helper : Remi"}],[{"episodeNumber":"1","title":"\"Super Wings Day\"","location":"World Airport","isPartOfDoubleEpisode":false,"description":" It is the Super Wings Day in World Airport, on this occasion, the Super Wings, composed of Jett, Dizzy, Paul, Donnie and Astra, compete in an obstacle course. But a new plane called \"Golden Boy\" who is part of the golden crew and is not part of the super wings has the intention to win the race. How will the main 5 Super Pets save the day from Golden Boy's interruption?\nPackage item : None\nWord of this episode : None\n\nSuper Wings helper : Super Pets (Jett Pet, Dizzy Pet, Donnie Pet, Paul Pet and Astra Pet)"},{"episodeNumber":"2","title":"\"Butterfly Rescue\"","location":"Michoacán","isPartOfDoubleEpisode":false,"description":" Jett goes to Mexico to deliver with Jett Pet a Butterfly costume to Andrea who wants to see the Monarch butterflies making their annual migration.\nPackage item : A Butterfly costume and a flower crown to Andrea\nWord of this episode : Perfecto (Perfect in Spanish)\nSuper Wings helper : Dizzy and Dizzy Pet \n\nNote : Jett does not go with his travel buddy, but Jett only goes with Jett Pet."},{"episodeNumber":"3","title":"\"Pisa Pasta Panic\"","location":"Pisa","isPartOfDoubleEpisode":false,"description":" Mario ordered Jett a spaghetti machine during a competition that makes the biggest spaghetti in existence. But the participation of Golden Boy in the contest may upset the course of the competition. \nPackage item : fresh dough machine for Mario\nWord of this episode : Bellissimo (Very beautiful in Italian)\n\nSuper Wings helper : Donnie and Donnie Pet"},{"episodeNumber":"4","title":"\"Spinning Tops\"","location":"Sapporo","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet come in the Odori Park to deliver Kenta a gigantic competition spinning top, but once they reach the final, they have to fight Golden Boy once again. \nPackage item : A spinning top for a tournament for Kenta\nWord of this episode : すごい (\"Sugoi\"; Amazing) in Japanese\n\nSuper Wings helper : Astra and Astra Pet"},{"episodeNumber":"5","title":"\"Baby Tiger Delivery\"","location":"Madhya Pradesh","isPartOfDoubleEpisode":false,"description":" A Young girl living in the jungle ordered a cat's toys to be able to get out the animal that has been hiding in her house, but it turns out that the animal in question is actually a baby tiger who has lost her mother. Jett, Shabu, and Jett Pet must quickly find her to return it to him through the jungle.\nPackage item : Plastic mouse and cat treats for Shabu\nWord of this episode : प्यारा  (\"Pyaara\", Sweet, adorable, cute in Bangla)\n\nSuper Wings helper : Paul and Paul Pet "},{"episodeNumber":"6","title":"\"Geneva Car Show Chaos\"","location":"Geneva","isPartOfDoubleEpisode":false,"description":" Leah lives in Geneva, and she's ordered to the Super Wings a pair of propellers for his new electronic car: Leo, who is going to participate in the city car show. But once they arrive, they have to come to the aid of an all-terrain vehicle that Golden Boy has gotten out of control. \nPackage item : Two ears with propellers for Leah's electric car: Leo \nWord of this episode : Biensûr (Sure in Swiss French)  \nSuper Wings helper : Dizzy and Dizzy Pet\nNote : Leo, like Flip in Season 2, is not a Super Wings at the base, he joins them at the end of the episode.\n\nNote 2: Sky answers the call in this episode for Super help because Jimbo is at the car show. "},{"episodeNumber":"7","title":"\"A Very Special Concert\"","location":"Mojave Desert","isPartOfDoubleEpisode":false,"description":" Jett leaves for the Mojave Desert to present an admirers card to his old friend Trevor, now a famous singer. Except that a twist will prevent them from going to New York where they had planned to do their concert, luckily the new Super Wing, Sunny, comes to save the show. \nPackage item : An admirer card made for Trevor by Tom. \nWord of this episode : Merci beaucoup (Thank you so much in French)\nSuper Wings helper : Sunny and Sunny Pet \n\nNote : Trevor from Season 1 Episode 52 returns in this episode."},{"episodeNumber":"8","title":"\"Airport Museum Adventure\"","location":"Seoul","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet leave for the South Korea Aviation Museum to deliver a young girl named Minji an aviation suit as she will meet the old plane that accompanied her grandfather, except that he does not seem to have arrived at his destination. \nPackage item : A child size aviator suit . \nWord of this episode : 만나서 반가워 (mannaseo bangawo or bangawo \"Nice to meet you\" in Korean) \nSuper Wings helper : Donnie and Donnie Pet\n\nNote : Narae appeared in this episode. It's not a Super Wings member, but the mascot of the museum."},{"episodeNumber":"9","title":"\"Swedish Snowstorm Sleepover\"","location":"Stockholm","isPartOfDoubleEpisode":false,"description":" A girl named Lily organizes a sleepover with her friend Karin, her father ordered a phone for her to finally let her know where she is, except that she is trapped in the snow. Jett, Astra, and the Super Pets are going to help her out of the room so the girls can have their sleepovers. \nPackage item : A phone with geolocation for children for Lily  . \nWord of this episode : Hurra (Horray) in Swedish  \n\nSuper Wings helper : Astra and Astra Pet"},{"episodeNumber":"10","title":"\"Supermoon Super Save\"","location":"China & Moon","isPartOfDoubleEpisode":true,"description":" It's the Supermoon, and on this occasion, the Super Wings and Storm want to make a surprise for the children of the whole world, Ressiou just wants to see what it is and has ordered a super powerful telescope to see better, but Golden Boy comes to interrupt the party with a counterfeit golden moon. Jett tries to stop it except that the wired moon bounces off the Super Moon which causes it to deviate from its Earth orbit, causing climatic catastrophes. After a failed attempt to return to orbit, the Moon heads straight for the Sun. Donnie and Jett must build their new robot suit to fix this disaster.  \nPackage item : A super powerful telescope for Ressiou. \nWord of this episode : 好主意 (Hǎo zhǔyì; \"Good Idea\") in Mandarin Chinese\n\nSuper Wings helper : Crystal, Paul, Paul Pet, Badge, Dizzy, Dizzy Pet, The Galaxy Wings (Rover, Astra, Astro and Astra Pet), Donnie and Donnie Pet"},{"episodeNumber":"11","title":"\"Supermoon Super Save\"","location":"China & Moon","isPartOfDoubleEpisode":true,"description":" It's the Supermoon, and on this occasion, the Super Wings and Storm want to make a surprise for the children of the whole world, Ressiou just wants to see what it is and has ordered a super powerful telescope to see better, but Golden Boy comes to interrupt the party with a counterfeit golden moon. Jett tries to stop it except that the wired moon bounces off the Super Moon which causes it to deviate from its Earth orbit, causing climatic catastrophes. After a failed attempt to return to orbit, the Moon heads straight for the Sun. Donnie and Jett must build their new robot suit to fix this disaster.  \nPackage item : A super powerful telescope for Ressiou. \nWord of this episode : 好主意 (Hǎo zhǔyì; \"Good Idea\") in Mandarin Chinese\n\nSuper Wings helper : Crystal, Paul, Paul Pet, Badge, Dizzy, Dizzy Pet, The Galaxy Wings (Rover, Astra, Astro and Astra Pet), Donnie and Donnie Pet"},{"episodeNumber":"12","title":"\"The Case of the Missing Town\"","location":"/ Whittier &  Hawaii","isPartOfDoubleEpisode":false,"description":" A little girl named Amka ordered a sweater for her dog Nacho to get through the very cold winter in Alaska. Except that she doesn't have the good surprise to discover Golden Boy and not Jett who gives her the package. As a result of Golden Boy's unsuccessful attempt to allow Amka and the rest of the building to spend the winter in Hawaii, Amka's dog gets lost in the ocean. The Super Wings must intervene quickly.  \nPackage item : A sweater that keeps you warm to spend the winter for Amka's dog: Nacho. \nWord of this episode : Unknown \nSuper Wings helper : Paul, Paul Pet, Jett and Jett Pet\n\nNote : Like in the Season 1 episode \"Boonying Bath\" and Season 3 episode \"Send in the Drones\", Another plane replaces Jett for its delivery, in this case in this one, it's Golden Boy."},{"episodeNumber":"13","title":"\"Digging for Truffles\"","location":"Dordogne","isPartOfDoubleEpisode":false,"description":" A young French girl named Sandrine has ordered a special device from the Super Wings that detects truffles buried in the ground, except that by losing her pig and Jett Pet, Jett has to call the Super Wings to the rescue. \nPackage item : A truffle detector. \nWord of this episode : Va chercher (Fetches in French) \n\nSuper Wings helper : Bucky, Paul and Paul Pet "},{"episodeNumber":"14","title":"\"Rock 'n' Troll\"","location":"Iceland","isPartOfDoubleEpisode":false,"description":" Jett goes to the Icelandic mountains, a place where according to the legends, would be populated by fantastic creatures such as the Trolls or the Elves, it is precisely one of these creatures that fascinates Magnus, who ordered a special house for these beings and meet them. Except Golden Boy wants to prevent that.   \nPackage item : An elf house for Magnus. \nWord of this episode : Velkomin (Welcome in Icelandic) \n\nSuper Wings helper : Dizzy, Dizzy Pet and Sparky"},{"episodeNumber":"15","title":"\"Super Pet Sweep Up Surprise\"","location":"World Airport","isPartOfDoubleEpisode":false,"description":" All of the Super Wings are at World Airport to clean up the World Aircraft, except that the Super Pets are delaying the operation by wanting to help them. To keep them occupied, Storm instructs his little sister, Windy, to keep them away until the cleaning is finished, everything but that a new manigance from Golden Boy, who wants to try to get rid of the Mini creatures, may well cause tasks. Now is the time to remove the dirt with Jett and the Super Wings.   \nPackage item : None  \nWord of this episode : None \nSuper Wings helper : Jett and Sparky \nNote 1 : This episode introduces Storm's little sister, Windy.\n\nNote 2 : Like in the \"Super Wings Day\" episode, there is no delivery made. This episode can be considered as filler."},{"episodeNumber":"16","title":"\"The Great Desert Dash\"","location":"Giza","isPartOfDoubleEpisode":false,"description":" A race across the Sahara is organized, and on this occasion, Nailah ordered to the Super Wings a tablet in which she can geolocate during the race. But a mystery contestant is determined to win the trophy. \nPackage item : A geolocalization tablet for Nailah. \nWord of this episode : بالتوفيق   (bialtawfiq, Good luck) in Arabic) \nSuper Wings helper : Leo and Leo Pet \n\nNote : Mambo, the all-terrain vehicle that appeared in the episode \"Geneva Car Show Chaos\", is back in this episode."},{"episodeNumber":"17","title":"\"Little Bug, Big Troubles\"","location":"La Fortuna","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet set off to deliver a package to Costa Rica for Adrian, who sets up an insect safari through the jungle, but Golden Boy decides to appropriate a particularly golden species of beetle. Jett must quickly get them back before he leaves the jungle. \nPackage item : A Bug suit to Adrian. \nWord of this episode : Vámonos (Let's go) in Spanish) \n\nSuper Wings helper : Dizzy and Dizzy Pet"},{"episodeNumber":"18","title":"\"Lost Toys in Dreamland\"","location":"Giengen","isPartOfDoubleEpisode":false,"description":" A mom ordered a teddy bear named Ute for her daughter Rachel because she lost her teddy bear named Lizzy. To help her, Jett, Astra, Squirt, their new friend Znap, and the Super Pets return to Rachel's dream to find Lizzy in toy land. \nPackage item : A very special teddy bear named Uma for Rachel. \nWord of this episode : Gute Reisa  (Safe travels) in German) \n\nSuper Wings helper : Astra and Astra Pet "},{"episodeNumber":"19","title":"\"Broadcast Station Commotion\"","location":"Seoul","isPartOfDoubleEpisode":false,"description":" A young boy named Yujun goes to visit TV studios with his father and little brother, Yown. In order not to lose sight of him, Jett brings him special bracelets to keep him close, but Yown's curiosity breaks the thread and becomes untraceable.  \nPackage item : Tracer bracelets for Yujun. \nWord of this episode : 멋져요! (Meosjida, Cool) in Korean) \n\nSuper Wings helper : Sunny and Sunny Pet"},{"episodeNumber":"20","title":"\"My New Neighbor\"","location":"Dunedin","isPartOfDoubleEpisode":false,"description":" A boy named Oliver ordered a pair of speed selector and a battery for his bike from the Super Wings, as he would like to ride Baldwin Street, which is New Zealand's steepest road. But losing control of its speed, the bike crashes into a moving house, Oliver, the Super Wings, and the young girl who just moved in, Mila, must quickly collect things from across the street.  \nPackage item : A speed selector for Oliver's bike  \nWord of this episode : Hoa-Noho (Residents, Flatmates) in Maori \n\nSuper Wings helper : Paul and Paul Pet"},{"episodeNumber":"21","title":"\"Alien Movie Stars\"","location":"Capilla del Monte","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet go to Argentina, to a festival dedicated to aliens, deliver a camera to Santiago so that he can shoot a science fiction film. It is when he confuses Golden Boy into an alien (in disguise) that he begins shooting the film. But Golden Boy's golden UFO spirals out of control and is forced to team up with Jett and the Super Wings to help Santiago make his movie a success.  \nPackage item : A camera for Santiago  \nWord of this episode : Recopado (Fantastic) in Spanish) \nSuper Wings helper : Astra, Astra Pet and Golden Boy\n\nNote : This is the first episode in the season in which Golden Boy doesn't fight or trick the Super Wings and joins them to save the situation."},{"episodeNumber":"22","title":"\"Flying Clouds of Color\"","location":"Nepal","isPartOfDoubleEpisode":false,"description":" A young girl named Bhanu has ordered an all-white dress from Jett that she wants to wear on a friend's birthday. Except that the party is held on the same day as Holi, the festival of colors.  And to make matters worse, Golden Boy, who also appears, is determined to sprinkle them with glitter yellow color.  \nPackage item : A white dress for Bhanu  \nWord of this episode : सुन्दर (\"Sundar\", Beautiful) in Hindi) \n\nSuper Wings helper : Paul and Paul Pet "},{"episodeNumber":"23","title":"\"Puppet Problems in Pilsen\"","location":"Pilsen","isPartOfDoubleEpisode":false,"description":" Jett flies to Pilsen to deliver a puppet that looks like him to a boy named Alex, as he is going to participate in the city's puppet festival. They organize a show about an ancient legend from the Czech Republic. Except that Golden Boy interrupts the play with his own puppet. Except after a few problems, he finds himself tangled in the threads of a giant dragon-shaped puppet. Will Jett and Donnie's robot suits help him break free?   \nPackage item : A Jett-shaped puppet for Alex   \nWord of this episode : Děkuju (Thanks You) in Czech) \nSuper Wings helper : Donnie, Donnie Pet and Remi \n\nNote : Donnie and Jett's robotic suits are used again after the episode \"Super Moon Super Save\". "},{"episodeNumber":"24","title":"\"Runaway Piggy Bank\"","location":"Rome","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet deliver a piggy bank that can move to Lorenzo, so he can fill it with coins, except that she escapes from his house and heads for the Trevi Fountain. It becomes gigantic after having sucked all the coins present in the basin, Jett and Donnie must return the recovered coins and return the piggy bank to its normal size.  \nPackage item : A moving piggy bank and a key for Lorenzo   \nWord of this episode : Ritorna (Come Back) in Italian) \n\nSuper Wings helper : Donnie and Donnie Pet "},{"episodeNumber":"25","title":"\"The Rain Dragon\"","location":"Zhangjiajie","isPartOfDoubleEpisode":false,"description":" Yenyen ordered a small lucky bag so that she could give it to the golden dragon in the cave in addition to wishing for it to rain so that her grandfather's plantations would be saved from the heat. Except that Golden Boy overheard Jett and Yenyen's conversation and intends to make her wish come true for him.  \nPackage item : A little lucky bag for Yenyen  \nWord of this episode : 福 袋  (Fúdài, lucky bag) in Chinese) \nSuper Wings helper : Astra, Astra Pet and Sparky \n\nNote : This is the second episode of the series in which a Mission Teams vehicle comes to help a member of another team, following the episode \"King Tan\" of Season 4 with Badge, helping Jett and Donnie. In this episode, it's Sparky who comes to help Jett and Astra."},{"episodeNumber":"26","title":"\"Newfoundland Snow Wonderland\"","location":"/ St. John's","isPartOfDoubleEpisode":false,"description":" Trisha and her class go on a school trip to a weather station to understand how snow forms, she has for the occasion ordered from Jett and Jett Pet a pair of gloves and a hat to be ready if the snow falls. Jett, Trisha and the rest of the class want to see the formation of snow for real, helped by Astra and Sisu coming in as a backup.   \nPackage item : A woolen hat and gloves for Trisha   \nWord of this episode : Frais (Fresh in Canadian French ) \nSuper Wings helper : Sisu, Astra and Astra Pet \n\nNote : Rover makes a very short appearance in this episode as a weather satelitte.  "},{"episodeNumber":"27","title":"\"Happy Birthday Fishies\"","location":"Vanuatu","isPartOfDoubleEpisode":false,"description":" Chay ordered waterproof invitation cards to be able to go underwater because she is celebrating her birthday. She goes with Jett to the unique Vanuatu submarine post office. Except that fish take the fruit hanging on the letters, risking delaying delivery. Paul and Paul Pet are called in to save the party.    \nPackage item : Impermeable invitation cards for Chay  \nWord of this episode : Hapi betde (Happy Birthday in Bislama) \nSuper Wings helper : Paul, Paul Pet and Badge \n\nNote : Sammy, the forklift, makes an appearance in the introduction segment of the episode since his cameo in the episode \"Manta Ray\" in season 3, as well as seasons 1 and 2. "},{"episodeNumber":"28","title":"\"Happy Mother's Day\"","location":"Adelaide","isPartOfDoubleEpisode":false,"description":" A delivery problem between Jett and Golden Boy delays the arrival of the package that Grace expects for Mother's Day, Golden Boy proposes to catch Grace's mother's plane, but ends up causing the plane to crash. Jett and Dizzy must rescue the flight. \nPackage item : A bouquet of white Chrysanthemums for Grace   \nWord of this episode : Fair Dinkum (That's the True) and Bye Mate (Goodbye) in Australian English \nSuper Wings helper : Dizzy, Dizzy Pet and Golden Boy \nNote 1 : This is the second episode in which Golden Boy helps the Super Wings to repair a disaster. \n\nNote 2 : Also, this episode introduces Jimbo's mother, who is invited to follow Jett's mission."},{"episodeNumber":"29","title":"\"There's a Shark in my Water Park!\"","location":"Austria","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet leave for a water park to deliver a cart to Lukas in which he can transport his catfish aquarium. But when he falls into the water and scares visitors, Jett, Dizzy and the Super Pets must retrieve him through the park's attractions.  \nPackage item : A cart used to transport heavy objects for Lukas    \nWord of this episode : Lass uns gehen (Let's go in German) \n\nSuper Wings helper : Dizzy and Dizzy Pet "},{"episodeNumber":"30","title":"\"Hamster Disaster\"","location":"/ London","isPartOfDoubleEpisode":false,"description":" An accident during a portal demonstration of Astra prevents Jett from making his next delivery to London. So it's up to Astra and Mini Astra to deliver a hamster wheel to Mark, except he escapes the house and, with Astra's failed attempt to bring the hamster home, makes him in turn giant and make go to the London Eye.  \nPackage item : A hamster wheel for Mark.  \nWord of this episode : Chuffed (Proud in British English) \nSuper Wings helper : Jett and Jett Pet \n\nNote : This is the second episode of the season in which another plane replaces Jett, following the episode \"The Case of the Missing Town\" with Golden Boy, in this one, it's Astra and Astra Pet."},{"episodeNumber":"31","title":"\"Perez the Mouse\"","location":"Uruguay","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet go to Uruguay deliver Selena a tooth box, because she has lost her first baby tooth. Selena's father asks Jett for help as he wants to bring his daughter a gold coin while disguised as Perez, the mouse who brings a coin to children when they lose a tooth in their sleep. But that's without counting the intervention of Golden Boy who wants to bring the coin to Selena himself.  \nPackage item : A toothbox for Selena   \nWord of this episode : Volemos (Let's fly in Spanish) \nSuper Wings helper : Donnie, Donnie Pet and Bucky \n\nNote : This is the second episode in which Bucky accompanies the super helps on the mission to help them, following the episode \"Digging for Truffles\". "},{"episodeNumber":"32","title":"\"Rock Spirit Family\"","location":"Finland","isPartOfDoubleEpisode":false,"description":" Petri, a famous heavy metal rock star in Finland, ordered a wig for his father to become more rock and roll than his son. Except that by letting himself be carried away by the atmosphere, he bypasses all the lights on the stage.   \nPackage item : A rock star wig for Petri's father.  \nWord of this episode : Äänekäs (Loud in Finnish ) \n\nSuper Wings helper : Sunny and Sunny Pet "},{"episodeNumber":"33","title":"\"Relay Delivery\"","location":"/ Toronto","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet leave to deliver various toys for Kamili's cousin so that he can go back to school for the first time. All donated by friends all over the world, except when they arrive in Mount Kilimanjaro, not everything goes as planned.  \nPackage item : A giant bag for Kamili  \nWord of this episode : C'est super (That's Great in French ) \nSuper Wings helper : Leo and Leo Pet \n\nNote : In this episode, Jett comes to visit children who appeared in previous episodes: Nayla and Galilea, respectively appeared in the episodes \"Wild Horse Heroes\" and \"Constellation Situation\" in Season 3. As well as Bhanu in the recent episode \"Flying Clouds of Colors\" in Season 5."},{"episodeNumber":"34","title":"\"Jurassic Journey\"","location":"Mongolia","isPartOfDoubleEpisode":true,"description":" Nambayar found a dinosaur egg, a fossil of a recent discovery in Mongolia, except that by installing the egg in the incubator that Jett and Jett Pet brought her, Coco, a baby tyrannosaurus rex, is born. With Storm's help, Jett, also with Dizzy and Donnie and their Super Pets, set off in Jurassic period to try and find Coco's mother. Except that several adventures put them to the test (a brachiosaur which is stamped in a rock wall, several dinosaurs at risk of falling from a precipice). It wasn't until Storm came to the rescue with Jett and Donnie's robot suits that Coco finally found her mother, who was chasing Golden Boy, also present.  \nPackage item : An incubator for Nambayar  \nWord of this episode : мөрөөдөл  (\"möröödöl\", Dream) in Mongolian \nSuper Wings helper : Dizzy, Dizzy Pet, Donnie, Donnie Pet and Storm \nNote : Nambayar from Season 1 Episode 10 and Season 4 Episode 18 returns in this episode.\n\nNote 2 : This is the second special episode in which Jett and the Super Wings travel to the past, following the double episode \"Trip to Time Past\" in Season 2.  "},{"episodeNumber":"35","title":"\"Jurassic Journey\"","location":"Mongolia","isPartOfDoubleEpisode":true,"description":" Nambayar found a dinosaur egg, a fossil of a recent discovery in Mongolia, except that by installing the egg in the incubator that Jett and Jett Pet brought her, Coco, a baby tyrannosaurus rex, is born. With Storm's help, Jett, also with Dizzy and Donnie and their Super Pets, set off in Jurassic period to try and find Coco's mother. Except that several adventures put them to the test (a brachiosaur which is stamped in a rock wall, several dinosaurs at risk of falling from a precipice). It wasn't until Storm came to the rescue with Jett and Donnie's robot suits that Coco finally found her mother, who was chasing Golden Boy, also present.  \nPackage item : An incubator for Nambayar  \nWord of this episode : мөрөөдөл  (\"möröödöl\", Dream) in Mongolian \nSuper Wings helper : Dizzy, Dizzy Pet, Donnie, Donnie Pet and Storm \nNote : Nambayar from Season 1 Episode 10 and Season 4 Episode 18 returns in this episode.\n\nNote 2 : This is the second special episode in which Jett and the Super Wings travel to the past, following the double episode \"Trip to Time Past\" in Season 2.  "},{"episodeNumber":"36","title":"\"Peps the Super Dog\"","location":"Singapore","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet bring Lyu, a young girl who lives in Singapore, a little robot dog named Happi. Gift from her father because the young girl dreams of having a dog. Except that wanting to play with him, Happi, Jett Pet and several other dogs end up interrupting the kite party. Jett and Dizzy must then save Happi and one of the puppies, trapped in the wires of a kite.  \nPackage item : A little robotic dog for Lyu   \nWord of this episode : Budak baik (Good boy in Malay ) \n\nSuper Wings helper : Dizzy and Dizzy Pet "},{"episodeNumber":"37","title":"\"Special Trip Around the World\"","location":"Paris","isPartOfDoubleEpisode":false,"description":" A young boy named Victor dreams of traveling the world, so he ordered Jett and Jett Pet a board game so he can make his dream come true. But the game will turn out to be much more eventful when Golden Boy joins them to win the game. \nPackage item : A travel game around the world for Victor  \nWord of this episode : Génial (Awesome in French ) \nSuper Wings helper : Paul, Paul Pet and Golden Boy \n\nNote : Among the many places where Jett, Jett Pet, Victor and Golden Boy go to play the Travel Around the World game are Hawaii, Pisa, New York, Easter Island as well as Giza "},{"episodeNumber":"38","title":"\"The Flying Playhouse\"","location":"Baku","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet travel to Baku to deliver the twin sisters Fatima and Perry a cardboard cabin so that they can store their toys. Except the cabin breaks and Jett asks Donnie for help building a bigger cabin for the two sisters.   \nPackage item : A cardboard cabin for Fatima and Perry  \nWord of this episode : Tez Olun (Be quickly in Azeri ) \n\nSuper Wings helper : Donnie, Donnie Pet and Remi "},{"episodeNumber":"39","title":"\"Farm Friends Fetch\"","location":"Germany","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet leave to deliver a package to a farm in Germany, where Greta is waiting for him. This is a hat that can turn into a frisbee, because she wants to have fun with the animals on her grandmother's farm. But when the hat gets lost in the forest along with the animals, Jett must call on Sunny's positive energy to find them through the forest.  \nPackage item : A farmer's hat that can turn into a frisbee for Greta  \nWord of this episode : Fantastisch (Fantastic in German ) \n\nSuper Wings helper : Sunny and Sunny Pet "},{"episodeNumber":"40","title":"\"Royal Puppy Campers\"","location":"/ England","isPartOfDoubleEpisode":false,"description":" Jett and Jett Pet go to find Maribelle and Dominique who go camping with the little royal dogs. Except that once arrived there and following a game that turns into a disaster, a bear begins to pursue them through the forest. \nPackage item : Small motorhomes for the puppies of Maribelle  \nWord of this episode : Collywobbles (Being nervous in British English ) \nSuper Wings helper : Leo and Leo Pet \nNote : Princess Maribelle from Season 1 Episode 5 & Season 3 Episode 27 returns in this episode.\n\nNote 2 : Prince Dominique from Season 3 Episode 27 returns in this episode too."}],[{"episodeNumber":"1","title":"\"Fire Drill Heroes\"","location":"Amazon rainforest","isPartOfDoubleEpisode":false,"description":" Lidia and her class participate in a fire drill led by the girl's mother. But when a forest fire breaks out in the Amazon rainforest, she must quickly deal with it. Can Lidia handle another forest fire on her own while her mother is busy with the first fire? Luckily, Jett and the World Guardians, the new Super Wings team, are ready to help her\nPackage item : A firefighter costume for Lidia \nWord of this episode : Rápido (fast in Portuguese)\nSuper Wings World Guardians helper : Dizzy, Splash and Sparky\nSuper Ball Power used : Water Power\n\nNote : Jett now delivers the items in a new package shape with the form of a Super Ball in this season, and Jett Pet no longer goes with him "},{"episodeNumber":"2","title":"\"Pelmeni Panic\"","location":"Russia","isPartOfDoubleEpisode":false,"description":" Jett flies to Russia to deliver cooking utensils to a girl named Sasha, who wants to go to the International Space Station to prepare Pelmenis, a kind of ravioli, for her father who works on board. Unfortunately, when a problem occurs in the station, it is necessary to count on the help of a new friend, Lime the Super Wings cook, to restore the menu to normal.\nPackage item : A steam cooker for Sasha\nWord of this episode : в восторге (v vostorge, being excited in Russian)\nSuper Wings World Guardians helper : Lime and Astra \n\nSuper Ball Power used : Fire Power[7]"},{"episodeNumber":"3","title":"\"The Animals Come to Town\"","location":"Nairobi","isPartOfDoubleEpisode":false,"description":" Joy is a young boy living in the township of Nairobi, he discovers that in the city, the animals of the national park have escaped and are walking around, including a baby lion named Kimba. He orders a tablet from Jett to bring the animals back to the park, but once they arrive, they find themselves facing Golden Boy and his new sidekick: Golden Wheels. Can Jett and Joy stop them before they cause more damage and get Kimba the lion cub back?\nPackage item : A tactile tablet to communicate with animals for Joy\nWord of this episode : Kamilii (Perfect in Swahili)\nSuper Wings World Guardians helper : Paul  \nSuper Ball Power used : Animal Power\n\nNote : At the start of this episode of this season, Golden Boy is showing teaming up with a new accomplice, Golden Wheels."},{"episodeNumber":"4","title":"\"Watermelon Winner\"","location":"Gwangju, Mount Mudeungsan","isPartOfDoubleEpisode":false,"description":" Jeun-Yung and his father participate in the biggest watermelon contest organized by his village. To make the trip easier, Jett brings the young boy a giant slide that crosses the valley, except that things get complicated when the watermelon rolls faster and faster without stopping. Will Jett, Jeun-Yung, Rocky and Donnie, who has been called in to help, be able to stop the watermelon and save the contest?\nPackage item : A giant slide for Jeun-Yung \nWord of this episode : 이거 대박 (igeo daebag, \"this is so cool\" in Korean)\nSuper Wings World Guardians helper : Donnie \n\nSuper Ball Power used : Earth Power"},{"episodeNumber":"5","title":"\"Turtle Tornado\"","location":"İztuzu Beach","isPartOfDoubleEpisode":false,"description":" Jett delivers a wheelbarrow to Sevgi, who wants to build a fence to protect  turtle eggs during a storm near her home. But the eggs hatch anyway and the baby turtles are blown away by the storm.\nPackage item : A wheelbarrow that carries turtles for Sevgi\nWord of this episode : Git (can i go? in Turkish)\nSuper Wings World Guardians helper : Donnie \n\nSuper Ball Power used : Iron Power"},{"episodeNumber":"6","title":"\"Operation Lemon Landing\"","location":"Saint-Marguerite Island and Menton","isPartOfDoubleEpisode":false,"description":" Jett goes to deliver a giant inflatable boat for Emile, who wants to participate in the Lemon Festival in the city of Menton with his citrus robot. But during the sea crossing, the float falls into the water. It's time for the World Guardians and dragons to intervene to arrive in time for the parade.\nPackage item : An inflatable boat for Emile\nWord of this episode : S'il vous plaît (Please in French)\nSuper Wings World Guardians helper : Donnie \n\nSuper Ball Power used : Iron Power"},{"episodeNumber":"7","title":"\"Pyramid Playtime\"","location":"Giza","isPartOfDoubleEpisode":false,"description":" Selma orders a giant rattle from Super Wings for her toddler Baba who became a giant after being photographed by Grand Albert's camera, who lost him while visiting the World Aircraft. Except that the giant baby starts chasing tourists in camels to the pyramids and risks destroying them. Jett, Selma and Donnie must quickly repair the damage and return Baba to his normal size.\nPackage item : A giant rattle for Selma's little brother, Baba\nWord of this episode : رائع (\"rayie\", woaw in Arabic)\nSuper Wings World Guardians helper : Donnie and Grand Albert\nSuper Ball Power used : Iron Power\n\nNote : Grand Albert returns in this episode after his absence on Season 5 and his last appearance on the Season 4 episode \"Mexican Meow Mission\". "},{"episodeNumber":"8","title":"\"Vroom Vroom Bubble Trouble\"","location":"/ Banff","isPartOfDoubleEpisode":false,"description":" Henry loves to play with the electric car his father built for him, but when it gets dirty and the town's car wash breaks down, Henry decides to order a wash kit. Jett brings it to him and together they wash all the cars that were getting impatient. Except something goes wrong when they try to clean a garbage truck, asking for help from the World Guardians.\nPackage item : A car wash kit for Henry \nWord of this episode : it git'er done (it's done in English Canadian)\nSuper Wings World Guardians helper : Dizzy \n\nSuper Ball Power used : Wind Power"},{"episodeNumber":"9","title":"\"The Legendary Super Wing\"","location":"/ Greenland","isPartOfDoubleEpisode":true,"description":" Jett is about to go on his 300th delivery mission, and he's excited because if he succeeds, he'll get into the Super Wings Hall of Fame. An order from Eric in Greenland leads him and the young boy to discover a dinosaur stuck in a giant iceberg. Unfortunately the intervention of Golden Boy and Golden Wheels risks injuring the creature. With the dinosaur freed, he gets rid of the golden duo and grabs Eric to take him to the mountains. Jett decides to call in the World Guardians to stop the dinosaur before it hurts Eric. Will Jett be able to complete his 300th mission and enter the Hall of Fame and find out who this dinosaur really is?\nPackage item : A laser that melts ice for Eric\nWord of this episode : Kutaa (Hello in Greenlandic) \nSuper Wings World Guardians helper : Donnie, Dizzy, Paul, Astra, and World Aircraft as World Robot\nSuper Ball Power used : Wind, Lightning, Iron, Animal and Fire Power\nNote : Jett becomes a Legendary Super Wings at the start of this episode, entering the Hall of Fame after his 300th mission\nNote 2 : This the first episode of the season in which World Aircraft turn into World Robot\nNote 3 : Also, this episode show that shows that Tino, a legendary Super Wings, is trapped in a giant block of ice, probably since the beginning of the series\n\nNote 4 : Note 4 At the beginning of this episode it shows Jett and Astra flying in from a mission without Super Pets so the 299th mission could be a season 6 episode. "},{"episodeNumber":"10","title":"\"The Legendary Super Wing\"","location":"/ Greenland","isPartOfDoubleEpisode":true,"description":" Jett is about to go on his 300th delivery mission, and he's excited because if he succeeds, he'll get into the Super Wings Hall of Fame. An order from Eric in Greenland leads him and the young boy to discover a dinosaur stuck in a giant iceberg. Unfortunately the intervention of Golden Boy and Golden Wheels risks injuring the creature. With the dinosaur freed, he gets rid of the golden duo and grabs Eric to take him to the mountains. Jett decides to call in the World Guardians to stop the dinosaur before it hurts Eric. Will Jett be able to complete his 300th mission and enter the Hall of Fame and find out who this dinosaur really is?\nPackage item : A laser that melts ice for Eric\nWord of this episode : Kutaa (Hello in Greenlandic) \nSuper Wings World Guardians helper : Donnie, Dizzy, Paul, Astra, and World Aircraft as World Robot\nSuper Ball Power used : Wind, Lightning, Iron, Animal and Fire Power\nNote : Jett becomes a Legendary Super Wings at the start of this episode, entering the Hall of Fame after his 300th mission\nNote 2 : This the first episode of the season in which World Aircraft turn into World Robot\nNote 3 : Also, this episode show that shows that Tino, a legendary Super Wings, is trapped in a giant block of ice, probably since the beginning of the series\n\nNote 4 : Note 4 At the beginning of this episode it shows Jett and Astra flying in from a mission without Super Pets so the 299th mission could be a season 6 episode. "},{"episodeNumber":"11","title":"\"Choo-Choo Through The Water\"","location":"Denmark","isPartOfDoubleEpisode":false,"description":" Jett delivers a repair kit for Laerke, who wants to fix an old locomotive, Lauge, that she found while playing hide and seek with her friends. With the locomotive repaired, the little group decides to go to the train museum with their parents, when a problem on the tracks prevents Lauge from continuing in the right direction. It's up to the Super Wings train Tony to intervene in a hurry.\nWord of this episode : Hurting (Quick, Fast in Danish) \nSuper Wings World Guardians helper : Tony  \n\nSuper Ball Power used : Iron Power"},{"episodeNumber":"12","title":"\"Golden Wishes\"","location":"Laos","isPartOfDoubleEpisode":false,"description":" It's the Pha That Luang festival and Niphavanh needs a basket of flowers in order to make a wish, which Jett takes care of. But when Niphavanh is about to make a wish, Golden Boy and Golden Wheels steal the golden monument and go into space. With the help of Astra and Izzy, they try to recover the Pha That Luang from the two thieves.\nPackage item : A flower basket for Niphavanh\nWord of this episode : None \nSuper Wings World Guardians helper : Astra \n\nSuper Ball Power used : Lightning Power"},{"episodeNumber":"13","title":"\"Super Wing's Super Sidekick\"","location":"Shanghai and Hangzhou","isPartOfDoubleEpisode":false,"description":" Jett goes on a special mission to China, he is accompanied by Finley, a young boy from Wales who won a contest to deliver to Yen-Ching a camera for his cooking tutorial in a restaurant. Several problems prevent Jett and Finley from reaching her, they are helped by Tony who, as Train Express, will quickly send them to Yen-Ching\nPackage item : A camera for Yen-Ching \nWord of this episode : 快点 (\"Kuài diǎn\", hurry up in Mandarin Chinese)\nSuper Wings World Guardians helper : Tony \nSuper Ball Power used : Iron Power\n\nNote : This episode feature Finley from Wales, a Super Wings fan who come with Jett in a special mission, he's also based on a real person who win a Super Wings contest organized by a UK kids channel"},{"episodeNumber":"14","title":"\"Golden Delivery Disaster\"","location":"Pisa, Easter Island and Norvegia","isPartOfDoubleEpisode":false,"description":" After taking control of Astra's satellite, Golden Boy makes deliveries in Jett's place, in a very bad way that has the effect of disappointing the children. After Jett fixes Golden Boy's mess, he and the other Super Wings go to retrieve their satellite, but a space problem may complicate the task.\nPackage item : An ice cream cake, a giant brush and a scarf for three childrens, first delivered by Golden Boy, later by Jett\nWord of this episode : None\nSuper Wings World Guardians helper : Dizzy, Paul, Donnie, Astra, and World Robot\nSuper Ball Power used : Earth, Wind, Lightning, Animal and Fire Power, but they just being absorbed by the black hole\nNote : This is the second episode of the series in which Golden Boy is making deliveries in Jett's place after the episode \"The Case of the Missing Town\" in Season 5.\n\nNote 2 : World Aircraft make his second appearance as World Robot."},{"episodeNumber":"15","title":"\"Pass That Torch\"","location":"Athens","isPartOfDoubleEpisode":false,"description":" It's the Junior Olympics in Athens, and on this occasion, Helen offers the Super Wings to participate in the torch relay to open the competition. The relay goes on without incident until Golden Boy and Golden Wheels get involved.\nPackage item : A torch that does not extend for Helen\nWord of this episode : Οδύσσεια (\"Odýsseia\", Odyssey in Greek)\nSuper Wings World Guardians helper : Paul and Astra \nSuper Ball Power used : Animal Power \n\nNote : Like Grand Albert, Willie makes his first return in this episode since his last appearance in the episode \"Happy New Year Adventure\" of Season 4"},{"episodeNumber":"16","title":"\"White Elephant Rescue\"","location":"Chiang Mai","isPartOfDoubleEpisode":false,"description":" When Kulap's elephant sanctuary floods in Chiang Mai, Thailand, She orders elephant-sized life jackets and water wings so she can guide the elephants to safety. Complications arise when Cory, a baby elephant, is separated from the group and carried away by water currents. Jett already has his hands full with the other elephants and Kulap can't rescue Cory alone.\nPackage item : Five life jackets and water wings for Cory and the elephants\nWord of this episode : ช้างเผือก (\"Cĥāngp̄heụ̄xk\", white elephants in Thai)\nSuper Wings World Guardians helpers : Dizzy and Sparky \n\nSuper Ball Power used : Water Power"},{"episodeNumber":"17","title":"\"Measure of a Treasure\"","location":"Jordan","isPartOfDoubleEpisode":false,"description":" Abu is going on the adventure of a lifetime! Exploring the excavations at Petra in Jordan with his archaeologist treasure-hunter Uncle. But there's a big problem: he forgot to bring along one of his prized toy robots. He never goes anywhere without at least one of them! But the Super Wings save the day!\nPackage item : A transforming cube shaped robot for Abu\n\nWord of this episode : TBA\nSuper Wings World Guardians helper : Donnie \n\nSuper Ball Power used : Earth Power"},{"episodeNumber":"18","title":"\"Colossal Fossil Surprise\"","location":"Erfoud","isPartOfDoubleEpisode":false,"description":" Jett flies to Erfoud, Morocco, and delivers a fossil detector to a boy named Kamal. Kamal wants to find a rare fossil to complete his collection, but he's having a hard time spotting one. When the detector locates some strange shapes underground, Jett digs deep and he and Kamal find themselves in an underground lake with a live, ancient whale called a Basilosaurus!\nPackage item : A fossil detector for Kamal \nWord of this episode : TBA\nSuper Wings World Guardians helper : Tino \n\nSuper Ball Power used : Animal Power"},{"episodeNumber":"19","title":"\"Rubbish Recycling Rescue\"","location":"Mantanani Islands","isPartOfDoubleEpisode":false,"description":" Jett delivers recycling boxes to Zikri, a young boy who worries that the dirty beaches of Mantanani Island will stop his friend Duggy the manatee from visiting. Jett, Zikri and his Grandpa clear the sand but then discover an even bigger problem, an island of rubbish floating in the sea.\nPackage item : Three recycling boxes for Zikri and his Grandpa\nWord of this episode : Bersihkan (Clean up in Malay)\nSuper Wings World Guardians helper : Donnie \n\nSuper Ball Power used : Iron Power"},{"episodeNumber":"20","title":"\"Missing Mona Lisa\"","location":"Paris","isPartOfDoubleEpisode":false,"description":" Jet flies to Paris, France and delivers a telescope to a girl named Amélie. Amélie is at the very crowded Louvre Museum with her mom and needs the telescope to see the most famous work of art in the world: The Mona Lisa.\nPackage item : A pair of binoculars for Amelie\nWord of this episode : Je suis Desole (I'm sorry in French)\nSuper Wings World Guardians helper : Astra \n\nSuper Ball Power used : Technology Power "},{"episodeNumber":"21","title":"\"Sporty Sea Lion Surprise\"","location":"/ San Francisco","isPartOfDoubleEpisode":false,"description":" A girl named Bella is looking forward playing basketball with her Dad as soon as he finishes his work unloading a cargo container of fruit from a ship docked at San Francisco's Pier 39. But playful sea lions cause the cargo container to spill all its fruit into the harbour.\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Dizzy \n\nSuper Ball Power used : TBA"},{"episodeNumber":"22","title":"\"The Marina Bay Monster\"","location":"Singapore","isPartOfDoubleEpisode":false,"description":" A boy named Riley is in Singapore visiting a friend, a girl named Lifen who is a local movie star. They want to make a monster movie with Riley directing and Lifen starring. Golden Boy is a huge fan of Lifen's and wants to be in the movie with her, so he makes himself mega-sized and he gets the monster role. \nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Astra \n\nSuper Ball Power used : TBA"},{"episodeNumber":"23","title":"\"Puppy Patrol Partners\"","location":"/ Stonehenge","isPartOfDoubleEpisode":false,"description":" Maggie wants to be a buddy-cop-duo with her pet Chihuahua, Kiki, and help people in need. So, Jet delivers police costumes for Maggie and Kiki and then joins them in patrolling the town. After a bit of a rough start, the patrol team finds a couple who needs help finding Stonehenge, the famous, ancient stone circle\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Paul \n\nSuper Ball Power used : TBA"},{"episodeNumber":"24","title":"\"Trouble in Tiny Town\"","location":"Germany","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : Jett flies to Hamburg to deliver a pair of mini vacuum cleaners to help Lars and his Dad clean up a spillage of popcorn across their impressive model village. They run into problems, though, when they find difficulty reaching popcorn inside the village's train tunnel.\nWord of this episode : TBA\nSuper Wings World Guardians helper : Tony \n\nSuper Ball Power used : TBA"},{"episodeNumber":"25","title":"\"Great Wall Express\"","location":"China","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : Peiru and her dad are hiking the Great Wall of China in Beijing. Heavy snowfall has made the Great Wall difficult to traverse, so Peiru orders winter hiking gear to help their climb.\nSuper Wings World Guardians helper : Tony \n\nSuper Ball Power used : TBA"},{"episodeNumber":"26","title":"\"Underwater Wheels\"","location":"/ North Carolina","isPartOfDoubleEpisode":false,"description":" Dale wants to be in an underwater bike race with his dad, and help him win. So Jett delivers a tandem bicycle and agrees to join their team. Things take a turn when Golden Boy enters the race and sends them off-course. Their bike collides with Captain Wreck, a sunken pirate ship who's been fast asleep. She awakes and thinks they're stealing her treasure.\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Dizzy \n\nSuper Ball Power used : TBA"},{"episodeNumber":"27","title":"\"Sick Day Save\"","location":"South Korea","isPartOfDoubleEpisode":false,"description":" A toddler in South Korea named Ha-Jun has a cold but doesn't like the taste of the medicine that his Dad needs to give him. Ha-Jun's sister Yuna calls the Super Wings for help and Jett brings a special jelly ball shaped like a plane filled with the medicine. Ha-Jun wants it now because he likes airplanes.\nPackage item : A jellyball with medicine inside\nWord of this episode : TBA\nSuper Wings World Guardians helper : Astra \n\nSuper Ball Power used : TBA"},{"episodeNumber":"28","title":"\"Arctic Fox Friends\"","location":"Iceland","isPartOfDoubleEpisode":false,"description":" A boy named Geir in Iceland goes with his Mom on a tour in a giant glacier bus to see arctic foxes in their natural habitat. Geir orders an arctic fox costume to wear so the shy foxes will come out of their caves and meet him.\nPackage item : An Arctic Fox costume for Geir\nWord of this episode : TBA\nSuper Wings World Guardians helper : Tino \n\nSuper Ball Power used : TBA"},{"episodeNumber":"29","title":"\"Mid-Air Mess Up\"","location":"Germany","isPartOfDoubleEpisode":false,"description":" Jett delivers a huge inflatable sword to Neele, an accessory for the balloon version of the legendary dragon-fighter Siegfried she is flying with her Papa in the annual balloon festival. Unfortunately, Golden Boy and Golden Wing are also attending, flying their inflatable, smoke billowing dragon balloon!\nPackage item : an inflatable sword for Neele\nWord of this episode : TBA\nSuper Wings World Guardians helper : Dizzy \n\nSuper Ball Power used : TBA"},{"episodeNumber":"30","title":"\"Soccer with Stone Statues\"","location":"Colombia","isPartOfDoubleEpisode":false,"description":" Fabio loves soccer but he is not interested in history. One day Fabio's Mom takes him to visit her workplace which is the famous San Augustin Archeological park. Fabio brings his ball, not expecting to have any fun from this tour. Then he accidentally drops his ball into one of sites with many ancient statues!\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Donnie \n\nSuper Ball Power used : TBA"},{"episodeNumber":"31","title":"\"World Robot vs Golden Robot Part 1\"","location":"Tuvalu & Antarctica","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : \n\nSuper Ball Power used : TBA"},{"episodeNumber":"32","title":"\"World Robot vs Golden Robot Part 2\"","location":"Antarctica","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : \n\nSuper Ball Power used : TBA"},{"episodeNumber":"33","title":"\"Volcano Pizza\"","location":"Italy","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Lime \n\nSuper Ball Power used : TBA"},{"episodeNumber":"34","title":"\"Fiji Camping Chaos\"","location":"Fiji","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Donnie \n\nSuper Ball Power used : TBA"},{"episodeNumber":"35","title":"\"Hot Taco Trouble in Mexico\"","location":"Mexico City","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Lime \n\nSuper Ball Power used : TBA"},{"episodeNumber":"36","title":"\"Bibimbap Til Ya Drop\"","location":"South Korea","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Lime \n\nSuper Ball Power used : TBA"},{"episodeNumber":"37","title":"\"I Want to Meet the Moon Lady!\"","location":"China","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Donnie \n\nSuper Ball Power used : TBA"},{"episodeNumber":"38","title":"\"Coloring The Cosmos Part 1\"","location":"Transinne","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Astra, Rover and World robot \n\nSuper Ball Power used : TBA"},{"episodeNumber":"39","title":"\"Coloring The Cosmos Part 2\"","location":"Solar System","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Astra, Rover and world robot \n\nSuper Ball Power used : TBA"},{"episodeNumber":"40","title":"\"Treasure Hunt in Peru\"","location":"Peru","isPartOfDoubleEpisode":false,"description":" TBA\nPackage item : TBA\nWord of this episode : TBA\nSuper Wings World Guardians helper : Paul \n\nSuper Ball Power used : TBA"}],[{"episodeNumber":"1","title":"\"Panda Museum\"","location":"Chengdu","isPartOfDoubleEpisode":false,"description":" Three pandas were out of a panda center\n\nSuper Wings helper : Dizzy"},{"episodeNumber":"2","title":"\"Finding Fara's Family\"","location":"Ocean","isPartOfDoubleEpisode":false,"description":" Jett and Paul try's to find Fara the Dolphin's home\n\nSuper Wings helper : Paul "},{"episodeNumber":"3","title":"\"Royal Dog Training Class\"","location":"Stockholm","isPartOfDoubleEpisode":false,"description":" Jett and Donnie with princess visit royal dog training school. \n\nSuper Wings helper : Donnie "},{"episodeNumber":"4","title":"\"Birthday Bash\"","location":"Mexico City","isPartOfDoubleEpisode":false,"description":" Jett and Jerome go to birthday party. \n\nSuper Wings helper : Jerome "},{"episodeNumber":"5","title":"\"Cat Tower Catastrophe\"","location":"Pisa","isPartOfDoubleEpisode":false,"description":" Jett and Shine go to clean up mess that cat made. \n\nSuper Wings helper : Shine "},{"episodeNumber":"6","title":"\"Robot Dance Competition\"","location":"Pohang","isPartOfDoubleEpisode":false,"description":" Jett and Jerome go to robot dance competition. \n\nSuper Wings helper : Jerome "},{"episodeNumber":"7","title":"\"Big Bird Bother\"","location":"Serengeti National Park","isPartOfDoubleEpisode":false,"description":" Jett and Ellie goes to Serengeti National Park. \n\nSuper Wings helper : Ellie "},{"episodeNumber":"8","title":"\"Wild Waterslide with Hippos\"","location":"Kenya","isPartOfDoubleEpisode":false,"description":" Jett and Donnie go there to make slide-waters. \n\nSuper Wings helper : Donnie "},{"episodeNumber":"9","title":"\"Snow in the Sahara\"","location":"Sahara desert","isPartOfDoubleEpisode":false,"description":" Jett and Astra go to Sahara desert. \n\nSuper Wings helper : Astra "},{"episodeNumber":"10","title":"\"A Magic Carpet Ride\"","location":"Istanbul","isPartOfDoubleEpisode":false,"description":" Jett and Ellie go to Istanbul. \n\nSuper Wings helper : Ellie "},{"episodeNumber":"11","title":"\"Himalayan Yeti Yikes\"","location":"Himalayas","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy go to the Himalayas. \n\nSuper Wings helper : Dizzy "},{"episodeNumber":"12","title":"\"Space Birthdy Party\"","location":"Outer Space","isPartOfDoubleEpisode":false,"description":" Jett and Astra go to outer space. \n\nSuper Wings helper : Astra "},{"episodeNumber":"13","title":"\"Toy Factory Trouble\"","location":"Shantou","isPartOfDoubleEpisode":false,"description":" Jett and Donnie go to a toy factory. \n\nSuper Wings helper : Donnie "},{"episodeNumber":"14","title":"\"Itchy Lion Rescue\"","location":"Hennenman","isPartOfDoubleEpisode":false,"description":" Jett and Astra go to a wildlife preserve. \n\nSuper Wings helper : Astra "},{"episodeNumber":"15","title":"\"Busan Video Game Arcade\"","location":"Busan","isPartOfDoubleEpisode":false,"description":" Jett and Ellie go to a video game arcade. \n\nSuper Wings helper : Ellie "},{"episodeNumber":"16","title":"\"Mighty Mammoth Sleigh\"","location":"Yamal Peninsula","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy go to Siberia. \n\nSuper Wings helper : Dizzy "},{"episodeNumber":"17","title":"\"Denmark Dinosaurs Part 1\"","location":"Copenhagen","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy go to a natural history museum. \n\nSuper Wings helper : Dizzy "},{"episodeNumber":"18","title":"\"Denmark Dinosaurs Part 2\"","location":"Copenhagen","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy go back in time. \n\nSuper Wings helper : Dizzy, Tino "},{"episodeNumber":"19","title":"\"Pet Hotel Panic\"","location":"Dubai","isPartOfDoubleEpisode":false,"description":" Jett and Paul go to a pet hotel. \n\nSuper Wings helper : Paul "},{"episodeNumber":"20","title":"\"Chasing the Comet\"","location":"Windhoek","isPartOfDoubleEpisode":false,"description":" Jett and Astra go to outer space. \n\nSuper Wings helper : Astra, Shine, Marc "},{"episodeNumber":"21","title":"\"Jett's Birthday Party\"","location":"Air","isPartOfDoubleEpisode":false,"description":" Jett goes to save the other Super Wings. \n\nSuper Wings helper : Jett "},{"episodeNumber":"22","title":"\"Super Wings Speed Squad\"","location":"Monza","isPartOfDoubleEpisode":false,"description":" Jett, Dizzy, and Jerome go racing. \n\nSuper Wings helper : Dizzy, Jerome "},{"episodeNumber":"23","title":"\"Teeny Toy Takers\"","location":"Lopburi","isPartOfDoubleEpisode":false,"description":" Jett and Paul help a kid find his toy. \n\nSuper Wings helper : Paul "},{"episodeNumber":"24","title":"\"How to Train Your Spider\"","location":"Madrid","isPartOfDoubleEpisode":false,"description":" Jett and Ellie go to a train station. \n\nSuper Wings helper : Ellie "},{"episodeNumber":"25","title":"\"Go Slow, Jett!\"","location":"Air","isPartOfDoubleEpisode":false,"description":" Jett eats a trick piece of chocolate that makes him slow. \n\nSuper Wings helper : Donnie "},{"episodeNumber":"26","title":"\"Blast from the Past\"","location":"Tahiti","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy help stop the potential damage of an underwater volcano. \n\nSuper Wings helper : Dizzy, Tino, Moza "},{"episodeNumber":"27","title":"\"World Aircraft Tour Day\"","location":"Air","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy have a mixed up delivery. \n\nSuper Wings helper : Dizzy "},{"episodeNumber":"28","title":"\"Paper Rangers are Back!\"","location":"Tokyo","isPartOfDoubleEpisode":false,"description":" Jett and Donnie help the Paper Rangers with a movie. \n\nSuper Wings helper : Donnie "},{"episodeNumber":"29","title":"\"Spin to Win Tornado\"","location":"Pueblo","isPartOfDoubleEpisode":false,"description":" Jett and Astra help stop a tornado. \n\nSuper Wings helper : Astra "},{"episodeNumber":"30","title":"\"Trash Monster Madness\"","location":"Caldas Novas","isPartOfDoubleEpisode":false,"description":" Jett and Shine stop a trash monster. \n\nSuper Wings helper : Shine, Marc "},{"episodeNumber":"31","title":"\"The Wild Little Mermaid\"","location":"Cebu","isPartOfDoubleEpisode":false,"description":" Jett and Jerome go to a mermaid class. \n\nSuper Wings helper : Jerome "},{"episodeNumber":"32","title":"\"Time Travel Mayhem Part 1\"","location":"Paris","isPartOfDoubleEpisode":false,"description":" Jett and Donnie help build an elevator at the Eiffel Tower. \n\nSuper Wings helper : Donnie "},{"episodeNumber":"33","title":"\"Time Travel Mayhem Part 2\"","location":"Paris","isPartOfDoubleEpisode":false,"description":" Jett and Donnie go back in time to make the Eiffel Tower a success. \n\nSuper Wings helper : Donnie "},{"episodeNumber":"34","title":"\"Flying Fish Frenzy\"","location":"Osaka","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy help make a giant fish kite. \n\nSuper Wings helper : Dizzy "},{"episodeNumber":"35","title":"\"Giant Harvest Hero\"","location":"Jeju Island","isPartOfDoubleEpisode":false,"description":" Jett and Astra save an orange grove from a tornado. Note: this is a sequel to the episode 'The Jeju Giant'.\n\nSuper Wings helper : Astra "},{"episodeNumber":"36","title":"\"Machu Picchu Adventure\"","location":"Machu Picchu","isPartOfDoubleEpisode":false,"description":" Jett and Ellie fall into a booby trap in Machu Picchu.\n\nSuper Wings helper : Ellie "},{"episodeNumber":"37","title":"\"Fastest Snail in the World\"","location":"Ha Long","isPartOfDoubleEpisode":false,"description":" Jett and Astra have to catch a runaway snail on a skateboard.\n\nSuper Wings helper : Astra "},{"episodeNumber":"38","title":"\"Down the Ant Tunnel\"","location":"Bernburg","isPartOfDoubleEpisode":false,"description":" Jett and Astra have to find a bead down an ant tunnel.\n\nSuper Wings helper : Astra "},{"episodeNumber":"39","title":"\"Rock N'Roll Pinball\"","location":"Monsanto","isPartOfDoubleEpisode":false,"description":" Jett and Paul have to stop a boulder from breaking a house.\n\nSuper Wings helper : Paul "},{"episodeNumber":"40","title":"\"Aerial Octo-Fuss!\"","location":"Weifang","isPartOfDoubleEpisode":false,"description":" Jett and Paul have to stop a giant kite.\n\nSuper Wings helper : Paul "}],[{"episodeNumber":"1","title":"\"Rocket Roller Coaster\"","location":"Wurttemberg","isPartOfDoubleEpisode":false,"description":" Jett and Marty go to a carnival. \n\nSuper Wings helper : Marty"},{"episodeNumber":"2","title":"\"Explore the Amazon\"","location":"Amazon River","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy go to the Amazon River to repair Leah and her mother's boat. \n\nSuper Wings helper : Dizzy "},{"episodeNumber":"3","title":"\"Giant Robot Puppy\"","location":"Singapore","isPartOfDoubleEpisode":false,"description":" Jett and Lucie have to shrink a giant robotic dog. \n\nSuper Wings helper : Lucie "},{"episodeNumber":"4","title":"\"Choo Choo! Baguette Train\"","location":"Paris","isPartOfDoubleEpisode":false,"description":" Jett and Marty help Nico carry the giant baguette to the school's baking festival. \n\nSuper Wings helper : Marty "},{"episodeNumber":"5","title":"\"Dinosaur Footprints!\"","location":"Goseong","isPartOfDoubleEpisode":false,"description":" Jett and Traver go back in time to find the owner of a dinosaur footprint. \n\nSuper Wings helper : Traver "},{"episodeNumber":"6","title":"\"Fly, School Bus!\"","location":"Vang Vieng","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy deliver monster truck tires. \n\nSuper Wings helper : Dizzy "},{"episodeNumber":"7","title":"\"Super Wings in the Stone Age\"","location":"Los Angeles","isPartOfDoubleEpisode":false,"description":" Jett and Tino have to deliver mood lights to a boy in Los Angeles, but go fast that they end up in prehistoric Los Angeles. \n\nSuper Wings helper : Tino "},{"episodeNumber":"8","title":"\"The Sphinx Came to Life\"","location":"Cairo","isPartOfDoubleEpisode":false,"description":" Jett and Sally have to uncover the sphinx from underneath a sandstorm, but get into trouble when Golden Boy and Golden Girl appear. \n\nSuper Wings helper : Sally "},{"episodeNumber":"9","title":"\"Dragon Dance Showdown\"","location":"Sichuan","isPartOfDoubleEpisode":false,"description":" Jett, Tiki, and Taki travel to China's Sichuan province to deliver a pair of jumping shoes. \n\nSuper Wings helper : Tiki and Taki "},{"episodeNumber":"10","title":"\"Jett Became a Giant!\"","location":"Antalya","isPartOfDoubleEpisode":false,"description":" Jett and Marty deliver sand castle-making tools to a girl on the beach, but meet Golden Boy and Golden Girl there. \n\nSuper Wings helper : Marty "},{"episodeNumber":"11","title":"\"Hamster Racing\"","location":"London, United Kingdom","isPartOfDoubleEpisode":false,"description":" Jett and Tino travel to London, England, and give an obstacle track to Mark's pet hamsters. \n\nSuper Wings helper : Tino "},{"episodeNumber":"12","title":"\"Walking School\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett and Marty help a school get to its students during a heavy snowstorm. \n\nSuper Wings helper : Marty "},{"episodeNumber":"13","title":"\"Growing Tulips on the Moon\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett and Dizzy travel to the moon to build a greenhouse to grow tulips in. \n\nSuper Wings helper : Dizzy "},{"episodeNumber":"14","title":"\"Super Wings Health Checkup Day\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" The Super Wings go for a health checkup, but Jett is covered in mud and it makes it harder to fly. \n\nSuper Wings helper : All Super Wings"},{"episodeNumber":"15","title":"\"Real Jett vs. Fake Jett\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Golden Boy and Golden Girl transform into Jett and Lucie and pretend to be Super Wings. \n\nSuper Wings helper : Lucie "},{"episodeNumber":"16","title":"\"Space Food Truck\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett, Tiki, Taki, and Rover deliver a set of cooking utensils to the base on the Moon. \n\nSuper Wings helper : Tiki, Taki, and Rover"},{"episodeNumber":"17","title":"\"Walking With Dinosaurs\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett and Sally deliver a gift box to a boy who puts a robot dinosaur in it.\n\nSuper Wings helper : Sally "},{"episodeNumber":"18","title":"\"A World Without Electricity\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett and Traver deliver a new TV so a girl can watch a soccer match with her dad. \n\nSuper Wings helper : Traver "},{"episodeNumber":"19","title":"\"The Great Dragonfly Disturbance\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett and Tino deliver a state-of-the-art dragonfly swatter. \n\nSuper Wings helper : Tino "},{"episodeNumber":"20","title":"\"Yeti and Cricket Showdown\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett, Tiki, and Taki deliver a folding net for a cricket match. \n\nSuper Wings helper : Tiki and Taki "},{"episodeNumber":"21","title":"\"World Spaceport Landing Operation\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" World Spaceport collides with a meteor and the engine is destroyed! World Spaceport will have to make an emergency landing at World Airport to make repairs. Jett and Marty rush to World Airport to build a landing pad. \n\nSuper Wings helper : Marty "},{"episodeNumber":"22","title":"\"Ice Festival Riot!\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett and Marty deliver a hand warmer to a girl during the Chinese Ice Lantern Festival. \n\nSuper Wings helper : Marty "},{"episodeNumber":"23","title":"\"New Year's Express Delivery Part 1\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" On New Year's Eve, Jett sets out with Tiki and Taki to deliver to children around the world. \n\nSuper Wings helper : Tiki and Taki "},{"episodeNumber":"24","title":"\"New Year's Express Delivery Part 2\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Traver rushes out to save Jett from falling with a crystal ball. However, when the energy of Traver's clock and Golden Girl's wand mix, a wormhole is formed, and Jett, Traver, Golden Boy, Golden Girl, and Layla travel dimensions with the ball. \n\nSuper Wings helper : Traver "},{"episodeNumber":"25","title":"\"Super Wings Knights\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett and Traver deliver knight armor to help a boy defeat a dragon. \n\nSuper Wings helper : Traver "},{"episodeNumber":"26","title":"\"Super Wings Stuck Together\"","location":"TBD","isPartOfDoubleEpisode":false,"description":" Jett and Lucie deliver a huge fur hat to a shivering camping car named Victor. \n\nSuper Wings helper : Lucie "}],[]]